[
{"type":"header","version":"5.2.2","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"wp_karyawan"},
{"type":"table","name":"wp_posts","database":"wp_karyawan","data":
[
{"ID":"4917","post_author":"233","post_date":"2025-01-27 13:08:36","post_date_gmt":"2025-01-27 05:08:36","post_content":"&nbsp;\n\nI recall an occasion when I brought my children out to play in the heavy rain with their raincoats and jumping in muddy puddles with my spouse. It is a simple activity that my children enjoy, but I recall receiving numerous stares from passers-by who looked at us in disbelief, particularly after my son climbed down into the drain on his own to pick up a ball that had rolled down. How has the once-normal sight of children playing in the rain come to be seen as odd, reshaped over the years by advancements in technology, evolving lifestyles, and changing societal norms? These experiences of play aren’t the only ones that have transformed in many ways. In fact, parenting during the preschool years in today’s fast-paced, technology-driven world likewise comes with unique opportunities and challenges. Many modern and young parents are required to balance traditional parenting practices with the demands of contemporary lifestyles and advancements in education.\n\n<strong>The Evolution of Preschool Education<\/strong>\n\nPreschool education has always laid the foundation for lifelong learning and development. But in the new era, driven by advancements in technology, changing family dynamics, and a rising focus on the importance of early childhood development, preschool has undergone significant transformation in many ways. Preschools now have more dynamic spaces designed with the emotional, social, and cognitive growth of children in mind to nurture them in creative and engaging ways. In recent years, parental partnership has also evolved where parents are more aware and involved in their children’s development in preschools. Parental partnership is about building a cohesive, collaborative environment where parents and educators now work together to support children’s growth and mental well-being. Parents are seen as active partners, and preschools make concerted efforts to foster communication, engagement, and collaboration.  Young fathers take on a more active role now in partnership with the schools and are seen as playing an equal role as mothers in providing holistic parental support. Grandparents are more technology savvy and are keen to participate in activities with the schools such as Grandparent’s Day and are willing to collaborate for other school activities. With the rise of technology in recent years, it has certainly transformed many aspects of how schools and parents engage with one another. This new era demands a collaborative approach, which is often referred to as parental partnership.\n\n<strong>Embracing Technology in Partnerships<\/strong>\n\nCommunication in preschools has become more open and accessible, offering various platforms such as mobile applications, updates, and newsletters to share insights into daily activities, diet, routines, and themes, all aimed at supporting further learning at home. The open and regular communication also allows teachers and parents to have consistent check-ins to discuss any changes, challenges, or achievements in the child’s behaviour. With educational technologies like online learning platforms, parents are increasingly involved in their children’s education. This collaboration creates a cohesive learning environment that extends beyond the classroom to support the children holistically. These platforms also facilitate consistent updates and dialogue. Parents are encouraged to share photos of projects that children participate in at home with family members. This active communication with teachers and schools helps parents understand how technology now plays an integral part in the children’s learning.\n\nTechnology not only plays a huge role in communication between schools and parents, but children are also learning how technology can be used in many ways. Schools and parents had to learn and adapt  quickly in using technology for online lessons during the Covid-19 pandemic. This highlighted the potential for virtual learning in early childhood settings though it also underscored the challenges of remote learning for young children. As technology continues to move at a  fast pace, we see how automation and artificial intelligence (AI) are also changing the future job market. This encourages preschools and parents to focus further on teaching children critical thinking, problem solving and adaptability skills that are vital for the future.  As technology becomes more prevalent, there is a strong push to ensure that screen time is balanced with hands-on activities and real-world interactions. Technology has blurred the lines between work, school, and communication, often leading to screen fatigue and mental health concerns. Both adults and children must navigate the fine line between leveraging technology for education and avoiding overexposure.\n\n<strong>Mental Well-Being<\/strong>\n\nChildhood is a critical period for brain development. Addressing a child’s mental distress early can prevent severe mental health issues in the longer term.  In this new era, we see how mental well-being is being brought to the forefront.  We see more emphasis on mental well-being as preschool curriculums now integrate activities that promote social-emotional learning (SEL), teaching children develop soft skills like empathy, self-regulation, and cooperation. Social emotional development refers to the process where children develop the ability to understand, manage and express their emotions. These skills are taught and enhanced further through small group learning and games.  Teachers are trained to recognise signs of stress and behavioural challenges and adopt practices such as mindfulness and breathing exercises to help children regulate. Parents are informed that preschools are partnering with local health providers to ensure children have access to necessary health services such as vision, hearing screening and mental health support. In doing so, we are also equipping our children with coping mechanisms that will benefit them throughout life.\n\nMental well-being education for parents is a vital part of fostering healthy families. Families are invited to learn more about the importance of social-emotional development through parental workshops and engagement sessions.  The ability to regulate emotions in healthy ways, think before acting, and reflect on behaviour are essential skills that families can teach their children – especially in an era of increased physical and online interactions. Schools play a crucial role by conducting workshops on child development, early learning strategies, and mental health, empowering parents to better support their children's growth. Parents are more attuned to the emotional and psychological needs of their children and are encouraged to foster open discussions about feelings and stress management. Fostering socio-emotional development during the preschool years ensures that children grow into emotionally intelligent and socially competent individuals. Mental well-being is a crucial aspect of a child's development. Addressing these socio-emotional skills early can prevent more severe issues later in life as it plays a fundamental role in overall mental health and well-being and is essential for success in both academic and personal life.\n\n<strong>Diversity, Inclusion and Cultural Awareness<\/strong>\n\nPreschool education has moved to prioritise play-based learning over rote learning, where children explore concepts through hands-on activities, storytelling, and imaginative play. Parents will have to look at education as holistic learning that celebrates academic achievements differently. With the shift in mindset to allow young children to explore learning with their hands using clay and paints rather than paper and pencil, it brings a strong message that education is now moving towards developing creative thinkers. This experiential learning ensures that children understand concepts deeply through experiences rather than rote memorisation. Schools use qualitative assessments to understand each child’s strengths and areas for growth, creating customised learning plans to meet individual children’s needs. At the same time, preschools today strive to create a more inclusive environment that celebrates diversity. This holistic, child-centred approach may be different from how parents received their education years ago, as the focus is to develop children holistically and empower them with relevant skills for life. The learning and understanding of different cultural practices are not only shared during festive celebrations but incorporated as part of the curriculum. Preschools often work with local cultural organisations to ensure their curriculum reflects the values, languages and traditions of the families they serve. This approach allows children to recognise differences, teaching acceptance and build mutual respect towards others.\n\n<strong>Empowering Parents<\/strong>\n\nParenthood is, of course, a lifelong journey. Empowering parents is about equipping them with the tools, knowledge and support from schools to be confident and effective caregivers. By providing education, fostering emotional well-being, encouraging positive parenting practices, and building a strong support network with other parents, it will help to create an environment that promotes the overall development and well-being of their children. When parents feel empowered, they are better able to navigate challenges and build resilient, healthy families. Measuring this family-school partnership can also provide valuable information on how teachers are progressing in areas such as communication with parents, responding to parental needs and incorporating suggestions about their children.  With dual-working parents becoming common, time management and quality interactions with children are crucial. We see how the gender roles in parenting have likewise evolved and there is a growing trend towards shared responsibilities in some households. Both parents are generally more involved in sharing of childcare, parental partnership and housework. With many parents now working from home or having more flexible hours, it allows them to spend more time with their children while managing the boundaries between work and family. Preschools offer support groups where parents can discuss challenges, share experiences, give suggestions to the school as well as seek advice from educators and other parents. This sense of community helps parents feel less isolated and more confident in their parenting. By providing insights about their child’s interests, strengths and areas for growth, teachers are able to tailor the classroom learning experiences to each individual child. Similarly, educators work with parents to share classroom’s activities that parents can reinforce at home. Modern parenting is a collaborative and dynamic partnership, with parents increasingly recognising the importance of being actively involved in their children’s learning and participating in school-led initiatives. However, some parents may find this challenging as they navigate the dual demands of adapting to technological advancements in education while managing household responsibilities.\n\n<strong>Conclusion<\/strong>\n\nPreschool partnerships in the new era are about recognising that early childhood education and development are best supported through collaboration with families, schools, and communities. These collaborations foster more holistic, inclusive and equitable learning environments that better prepare young children for future success. In working closely together, parents and educators can create a safe, nurturing environment where children feel secure and equipped to handle the world around them. This strong partnership not only strengthens individual families but also contributes to the development of healthy, resilient communities. By embracing technology, prioritising mental well-being, fostering diversity and inclusion, and empowering parents, we can ensure that preschool education in the new era meets the needs of children and their families. This collaborative approach lays the groundwork for a brighter future, where children are supported, understood, and prepared to thrive in an ever-changing world.\n\n<hr \/>\n\n<em>Fadilah Adnan holds a Master of Science in Early Childhood and is an adjunct lecturer with National Institute of Early Childhood (NIEC).  She has spent more than a decade being an educator, preschool centre leader, lecturer as well as a field supervisor.  Currently, she has moved her focus towards the Malay language curriculum for 3-6 year olds as she believes in ensuring that children are able to preserve their mother tongue language.<\/em>","post_title":"Preschool and Parental Partnership in the New Era","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"preschool-and-parental-partnership-in-the-new-era","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:36","post_modified_gmt":"2025-01-27 05:08:36","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4917","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4913","post_author":"231","post_date":"2025-01-27 13:08:33","post_date_gmt":"2025-01-27 05:08:33","post_content":"&nbsp;\r\n\r\nSingapore’s education system has undergone significant transformations over the years, aiming to provide equal opportunities for all students. In 2024, our secondary schools were introduced to the subject-based banding system (G1, G2, G3). While this move towards mixed-ability classrooms is a commendable step, it remains to be seen whether it will truly address the deep-rooted social and academic divisions that exist due to our education system.\r\n\r\nAt the heart of the issue lies the ultimate destination for students: Junior College (JC), Polytechnic (Poly), or Institute of Technical Education (ITE). This tripartite division, while seemingly created with good intentions, perpetuates a hierarchical structure that privileges academic excellence over other forms of intelligence and talent.\r\n\r\nOur Malay community is not immune to the negative impacts of these educational divisions. We often find ourselves navigating a complex social and educational landscape where Malay students are disproportionately overrepresented in ITEs and underrepresented in JCs.\r\n\r\nThe hierarchy in Singapore’s education system where JCs are seen as the “first choice” and ITEs as the “last choice” profoundly shapes the experiences and perceptions of our Malay students. How does this influence their sense of success and failure, and what impact does this have on our Malay students’ social identity? In what ways do the societal perceptions of academic success shape the experiences of Malay students in ITE and JC, and what are the challenges faced because of this?\r\n\r\nIn 2016, Sanwari’s thesis “I’m Not That Kind of Malay,” found that Malay youths adopted strategies such as defensive othering and social distancing as adaptive responses. These behaviours, in turn, reinforced in-group discrimination<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a>. With this thesis conducted 8 years ago, it is important to explore whether such phenomena still exist within the Malay community, given Singapore’s evolving educational landscape.\r\n\r\nYasmin, National Junior College alumna, added:\r\n<p style=\"padding-left: 30px;\">“I only had ITE friends after I left NJ and worked in F&amp;B. I refrain from saying where I am from to blend in because it is easier to talk to them without that barrier. Like they know me as myself and not a ‘<em>budak pandai <\/em>(smart kid) <em>from JC<\/em>.”<\/p>\r\nKhalis, an ITE College West student, expressed:\r\n<p style=\"padding-left: 30px;\">“I have met with Malay students from JC. Personally, I feel like they lack social skills and some of them think that they are better than students from ITE.”<\/p>\r\nAmirah, an ITE College East student, shared her observations:\r\n<p style=\"padding-left: 30px;\">“I know of some Malay ITE students who come from low-income and\/or broken families that have a lot of<em> riak<\/em> (arrogance in malay) and are rowdy because they think that everyone hates them. So, when they meet JC Malays, they think that the JC students think that they are better than them. I think JC students would have a hard time interacting with these ITE Malays because they will always think that the JC students think lowly of them.”<\/p>\r\nNurin, Raffles Institution alumna, shared her experience:\r\n<p style=\"padding-left: 30px;\">“I have friends that I’ve known since primary school who are super <em>mat<\/em> and <em>minah – <\/em>not in a bad way. The way they speak is just very different from my JC friends. They speak very <em>kasar <\/em>(coarsely), and no matter what I do, whenever I interact with friends from ITE, they always say that I am too proper, even though I feel that I am matching their energy. Yes, there are some JC students who do feel better and are pretentious, but from my own interactions, the moment people find out I am from JC, they just don’t want to talk to me anymore, and I get singled out.”<\/p>\r\nFrom the excerpts above, we can see that there exists this ‘invisible wall’ between our Malay JC and ITE students, solely because they are from different schools. But, how and why exactly does this happen?\r\n\r\nThe perception of “better-than-thou” attitudes of JC students creates an environment where interactions are charged with underlying assumptions and judgments. Some ITE students coming from a background that is often looked down upon, are primed to view JC students as dismissive, fostering a defensive attitude that can perpetuate further divides. On the other hand, JC students, who find themselves thrust into environments where they are the minority, often adopt a sense of ‘otherness’ because of their unfamiliarity with their peers’ backgrounds and experiences.\r\n\r\nThis division, even if unintentional, becomes a powerful force in reinforcing the separation between ITE and JC students. The ‘invisible wall’ goes beyond academic prestige; it is also about cultural and social capital.\r\n\r\nDue to their minority status within their cohort, Malay JC students are placed in an atypical position.\r\n\r\nAliya, Yishun-Innova Junior College alumna, shared:\r\n<p style=\"padding-left: 30px;\">“I’ve received a lot of backhanded compliments before. During orientation, I was the only Malay. ‘<em>Wah you Malay you enter JC<\/em>?’ In my head, I thought, ‘<em>Racist pe. I enter JC my problem la sia’. <\/em>But I think other races just don’t see many Malays in JCs so they view us as rare crystals.”<\/p>\r\nNurin expressed:\r\n<p style=\"padding-left: 30px;\">“Being a Malay\/Muslim surrounded predominantly by non-Malay\/Muslim students often makes me feel like a burden. Like when we want to hang out, they must keep in mind what I can or cannot eat. This was quite challenging for me because I did not want to be a burden to my friends.”<\/p>\r\nYasmin added:\r\n<p style=\"padding-left: 30px;\">“I discovered class disparity in JC. When we had to do projects, I had to do projects at my friends’ houses, and it’s always landed (property) or condo. Meanwhile, the people who usually live in HDBs are those from my race<em> – <\/em>the Malays.”<\/p>\r\nThese experiences illustrate the sense of discomfort and alienation that many Malay students feel when placed in a predominantly non-Malay\/Muslim environment, such as in many of Singapore’s JCs. The nuances of cultural and religious differences  — such as dietary restrictions — may seem trivial, but they can reinforce feelings of being an outsider. For many Malay students, these minor obstacles are constant reminders of their minority status within the social hierarchy of the school.\r\n\r\nIt’s essential to highlight that these challenges are not just personal inconveniences; they represent the deep-seated realities of class and ethnic divisions. For Malay students, who are disproportionately represented in lower-income housing and have lower average levels of academic attainment, these barriers act as constant reminders of the broader societal structures that shape their educational opportunities and social interactions.\r\n\r\nOn the other hand, Malay students in ITEs find an environment where their social and cultural capital is more recognised and appreciated. For these students, ITE offers a space where they can connect with peers who share similar backgrounds, cultural experiences, and worldviews. As a result, ITE becomes a place of comfort and belonging.\r\n\r\nKhalis shared how these disparities are viewed from the other side:\r\n<p style=\"padding-left: 30px;\">“Honestly, ITE has been really fun because I get to mix with people of my own race.”<\/p>\r\nBatrisya, ITE College East alumna, added:\r\n<p style=\"padding-left: 30px;\">“Being a Malay student in ITE allowed me to easily connect with a lot of people within the Malay community. I feel that being Malay gave me an advantage in ITE in terms of forming friendships and connections because the community is close-knit, and there’s a sense of familiarity and shared experiences.”<\/p>\r\nThis sense of belonging and ease in connecting with peers is a significant part of the ITE experience for many Malay students. In an environment where shared cultural values and experiences are the norm, students feel a sense of belonging, not just academically, but socially and culturally as well. In turn, this confidence can have a positive impact on their overall experience. Free from the pressure of fitting in, the ITE environment feels more like a second home to Malay students rather than just an institution for learning.\r\n\r\nIn contrast, Malay students in JCs often struggle with a sense of belonging, as they find themselves as the minority population. As Sanwari (2016) notes, patterns in Malay youths’ social experiences, both in school and in the workplace, shape their perceptions of themselves and other Malays. They internalise negative stereotypes and often consciously (or unconsciously) resist those notions in an effort to assert their own identities and challenge the assumptions placed on them<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a>. The lack of representation of Malays in JC can further deepen this sense of disconnection, leading most to become more inclined to engage in cultural activities to assert their identity and find a space where they feel comfortable.\r\n\r\nNurin expressed:\r\n<p style=\"padding-left: 30px;\">“My happiest moments are always with the Malay Language and Literature (MLL)\/Malay Language Elective Programme (MLEP) stuff. I really look forward to it. I don’t even know what I would do without it, not going to lie.”<\/p>\r\nOn a similar note, Aliya shared:\r\n<p style=\"padding-left: 30px;\">“Being a Malay in JC made me value the fact that I am Malay. Like since there were so few Malays, I decided to join the Malay Cultural Society (MCS) to sort of contribute to the population. I ended up being very involved and it made me appreciate my culture more.”<\/p>\r\nWhile engaging in cultural activities provides a sense of belonging, it also underscores the deeper challenges Malay students face due to the racial and cultural dynamics within these institutions.\r\n\r\nAccording to Solorzano et al. (2000) , while ‘microaggressions’ may seem harmless and expressed without overt malicious intent, they reflect stereotypes and beliefs that reaffirm the subordinate position of those on the receiving end<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a>. In Sanwari’s thesis, Malay youths had been confronted time and time again with others’ negative perceptions of their abilities and intellect for they are judged not based on their individual self, but on their race. These experiences of having their subordinate social position reinforced have negative impacts on their self-esteem, aspirations and achievements<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a>.\r\n\r\nThe perception that ITE students are academically less capable while JC students are academically elite only deepens the divide between the two educational pathways. This binary view oversimplifies the diverse experiences and abilities of students within each system. It fails to acknowledge that both groups consist of individuals with unique strengths, challenges and aspirations. Such generalisations not only reinforce social hierarchies but also limit the potential of students by imposing labels that don’t account for their varied academic journeys and personal circumstances.\r\n\r\nAmirah explained:\r\n<p style=\"padding-left: 30px;\">“Online, the public sees Malay ITE students <em>hisap rokok<\/em> (smoke cigarettes), wrecking things in the toilet or setting things on fire. It’s a bad image, and when I reveal myself as an ITE student, they think of me badly. I get told like ‘<em>oh typical Malay, take N Levels only,<\/em>’ and it makes me feel embarrassed. Some employers also don’t want ITE students because of our reputation.”<\/p>\r\nIman, a student at ITE College Central, shared:\r\n<p style=\"padding-left: 30px;\">“I’ve been told that we lack discipline and don’t have a future. But like some Malays aren’t keen on studying because they’re not interested so they doze off in class or just don’t go to school. But there are also those who really like their course, so they pay a lot of attention, and they have a high GPA, you know?”<\/p>\r\nYasmin shared a contrasting perspective:\r\n<p style=\"padding-left: 30px;\">“The Malay community views us JC students as the cream of the crop. They automatically assume we will go somewhere, and it puts unnecessary pressure on us to get a good job and uplift the community. We not only have to excel in academics but outside of academics as well. We must take up leadership roles, etc. I mean it’s good that we look outside of academics but there is this pressure to perform holistically because you are a Malay in JC and for a teenager, it’s a lot. It doesn’t allow you to look at other forms of success either.”<\/p>\r\nNurin added:\r\n<p style=\"padding-left: 30px;\">“I feel pressured because I’m told that it’s not easy for a Malay to get to where I am. I am still told to ‘<em>Be a doctor! Be a lawyer!’ <\/em>even though I have made it clear that I am not interested in those fields. Being Malay in JC seems like a niche and others will tell you that ‘<em>This is a big achievement! You cannot waste this opportunity; you have to make it big!’<\/em>”<\/p>\r\nStereotypes about ITE and JC students often stem from unfounded assumptions. ITE students face prejudice due to stereotypes that unfairly label them. These misconceptions overlook the diverse talents, aspirations, and potential that the ITE students possess. The stigma, reinforced by the media and social narratives, can undermine their self-esteem and ambitions, leaving many feeling undervalued. JC students, on the other hand, are pressured to excel holistically to serve as role models for their community. Being seen as the “exception” within their community, their journeys are made to be even more challenging as they face heightened expectations.\r\n\r\nAs a result, both ITE and JC students are trapped in a cycle of misunderstanding, where their individual struggles and achievements are overshadowed by stereotypical assumptions that limit their opportunities and reinforce social divisions.\r\n\r\nWe must reflect on how these stereotypes, reinforced by societal structures and biases, shape the experiences of Malay students in Singapore’s educational system. As discussed by Aziz, the habitus concept – originally introduced by Pierre Bourdieu – suggests that our thoughts, values, beliefs, and actions are deeply influenced by the social environment in which we are immersed. This concept is relevant when considering the divide between ITE and JC students<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a>. It is not only the educational pathways that shape their identities but also the societal pressures and stereotypes that surround them, often dictating their perceived worth and place within the community.\r\n\r\nNurin shared:\r\n<p style=\"padding-left: 30px;\">“Relatives like to use JC students as “bragging rights” and this makes others think that I ‘<em>berlagak bagus <\/em>(act all high and mighty)’ but I didn’t say or do anything. It’s my relatives that show off.”<\/p>\r\nThe above experience sheds light on how the community often elevates JC students, framing them as symbols of success. This pedestal, however, comes with a cost, as it perpetuates the stereotype that JC students are arrogant, even when these perceptions stem more from society’s views than from the students’ own actions.\r\n\r\nAmirah also commented:\r\n<p style=\"padding-left: 30px;\">“There is this whole thing about how JC students should teach ITE students. I think we should see ourselves as one Malay community. I don’t understand why it is always that ITE students must learn from JC students. I think if we are given the chance to feel like we are on-par with each other then ITE and JC students can connect more easily.”<\/p>\r\nThis highlights the common assumption that JC students are positioned as the ‘better’ role models. The idea of mutual learning and understanding taking place in the Malay community challenges this hierarchical thinking. Perhaps if students from different educational backgrounds are given more opportunities to connect on common ground, they can foster more empathy and support for one another.\r\n\r\nThis brings us to a crucial question: what does creating a hierarchy between ITE and JC students really achieve? Is it productive to impose this ranking, suggesting that one group is inherently ‘better’ than the other simply because JCs are often seen as the ‘first choice’ and ITEs as the ‘last resort? After all, the academic experiences and challenges faced by students in these two pathways appear to be covering the same themes – albeit in different contexts.\r\n\r\nRather than perpetuating divides, it's time we tear down the walls between ITE and JC students and create spaces where they can truly learn from one another. Imagine a future where students from both paths come together – not just to share knowledge, but to challenge stereotypes, build empathy, and grow collectively. Let’s advocate for programmes that break away from the hierarchy, encouraging collaboration, shared goals, and mutual respect. In doing so, we can nurture a generation that values diverse talents and supports each other, paving the way for a more united and resilient Malay community.\r\n\r\n<em>All quotes in this article are attributed to individuals using pseudonyms to protect their privacy and ensure confidentiality.<\/em>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Sanwari, F. N. (2016). “I’m not that kind of Malay”: negotiating Malay identity in Singapore. <em>Nanyang Technological University, Singapore<\/em><\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Ibid.<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Solorzano, D., Ceja, M., &amp; Yosso, T. (2000). Critical race theory, racial microaggressions, and campus racial climate: The experiences of African American college students. <em>Journal of Negro <\/em><em>Education<\/em>, 60-73.<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Sanwari, F. N. (2016). “I’m not that kind of Malay”: negotiating Malay identity in Singapore. Nanyang Technological University, Singapore<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Aziz, N. (2009) Malay Stereotypes: Acceptance and Rejection in the Malay Community. <em>National University of Singapore, Singapore<\/em><\/span>\r\n\r\n<hr \/>\r\n\r\n<em>Sherlita Almeyra Sherhan is a graduate of Raffles Institution and currently a Research Intern at RIMA. Her research interests lie in exploring social issues affecting the Malay community and the preservation of Malay culture in the context of global influences. She is the Co-Founder and pro-bono CEO of MudaSG, Vice-Chairperson of M3@GeylangSerai and Youth Lead for M3@JalanBesar.<\/em>","post_title":"The JC-ITE Dichotomy: How Educational Hierarchies Perpetuate the Divide Within ","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"the-jc-ite-dichotomy-how-educational-hierarchies-perpetuate-the-divide-within","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:33","post_modified_gmt":"2025-01-27 05:08:33","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4913","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4905","post_author":"235","post_date":"2025-01-27 13:08:39","post_date_gmt":"2025-01-27 05:08:39","post_content":"<i><span data-contrast=\"auto\">Ujub, <\/span><\/i><span data-contrast=\"auto\">an Arabic term that can be translated to vanity, self-admiration or self-conceit, denoting a spiritual ailment when a person becomes excessively impressed with their own abilities, accomplishments or status. A sickness pertinent to someone like me, who works in the entertainment industry. As I navigate life in the entertainment business, one that is performative on television and on the silver screens, I can’t help but to notice the changes in my behaviour throughout my 18 years of career. One that I wish to share, in hopes that I can enlighten hearts and minds alike with this humble read. The world today is more connected and more visible than ever before, largely due to social media. Platforms like Instagram, Facebook, TikTok, and X allow myself and millions of others to showcase curated snapshots of our lives – a social practice I had to get acquainted with. I still remember the days when I was pursuing my diploma in the arts back in 2005, where social media was not as pervasive as it is today. Then, for one to be recognised in the field, you need to be exceptional in your craft. That, however, has changed. The amount of visibility attached to one’s name in the online space can pretty much secure contractual gigs due to the perceived value one has to offer.<\/span><span data-ccp-props=\"{}\"> <\/span><!--more-->\n\n<span data-ccp-props=\"{}\"> <\/span><span data-contrast=\"auto\">While there is nothing wrong with sharing joyful moments like achievements, talents, travels and experiences on social media, I often found myself seeking validation through likes, comments and shares. I noticed how these external validations would feed my ego and inflate my self-importance. For each time I received praise, I felt a rush of pride and satisfaction. I came to realise how this pursuit of approval can transform into a form of <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\">. Social media encourages constant comparison, creating an environment where self-promotion becomes a norm. I’ve observed and admittedly, sometimes, participated in the ‘competition’ to present oneself as the most successful, attractive, or talented. The result is often an overemphasised personal image and a tendency to measure worth based on digital reactions. The attention I received became addictive, leaving me vulnerable to pride and self-centeredness. Social media’s role in normalising <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\"> is undeniable as it amplifies our need to be seen, celebrated, and envied. The more I invested in crafting my online persona, the more I fell into the depths of self-admiration. The worst part of it, when our worth is tied to numbers on the digital space, we unknowingly subscribe to a lifelong endeavour which has no cap.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">Beyond social media, the culture of self-branding permeates many aspects of modern life. In professional settings, I’m constantly encouraged to “sell myself” – highlighting my strengths, successes and unique qualities. This very culture of self-branding requires me to focus intently on my accomplishments and build a narrative of success. On one level, this can be empowering, helping me to develop self-confidence and assert my capabilities. However, it can also foster a sense of entitlement and superiority, especially when I compare myself with others. I’ve caught myself, on more than one occasion, feeling a sense of pride and even disdain for those who I perceived as less accomplished. This kind of thinking I truly believe is a manifestation of <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\"> and it contradicts the principles of humility and empathy that I strive to uphold.<\/span><span data-ccp-props=\"{}\"> <\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">Materialism and individualism further complicate the picture, as society often equates success with wealth, status, and worldly possessions. I was constantly bombarded with “advice” that urged me to “stand out”, “be the best”, etc. In this environment, my self-worth became tied to what I’ve accomplished and what I own. When I focused on these outwardly markers of success, I started to believe that I am inherently better than others who may have not achieved the same. It was all in my head. This sense of superiority, it was all <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\">. The heart of it. It blinded me of my flaws, making me less likely to engage in self-reflection and spiritual growth. Consumed by self-admiration, I failed to recognise the source of my blessings and began to attribute my successes solely to my own efforts. This mindset led to a lack of gratitude and made me forget my dependence on the divine. It prevented me from acknowledging my shortcomings as I was too constantly focused on how great I am, and not seeing the areas I needed to grow or repent.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">Combating <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\"> requires ongoing self-awareness and effort. One of the practices that has helped me resist this tendency is by cultivating gratitude, although sometimes it’s hard to do so. This is especially when the situation and circumstances do not favour us. By regularly reflecting on my blessings, I remind myself that all my talents, successes, gifts and opportunities are from Allah SWT. This reminds me of my dependence on the Creator and humbles me in the face of his infinite wisdom and mercy.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">I remember a suggestion by an acquaintance to do community work that was not related to the media. I tried to be part of the grassroots team and even ran speech and drama classes for special needs children. It helped. When I focus on serving others, collaborating, and supporting those around me, I’m less likely to become preoccupied with my own ego. Building authentic connections based on empathy and mutual respect reminds me that I am not in the centre of the universe. This perspective really helped me maintain humility and recognise that my worth does not come from my accomplishments alone.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">Mindful engagement with social media is another important exercise I do. I’ve started to question my motives each time I share or post content. Am I seeking validation from others? Am I trying to boost my own ego? If the answer is yes, I take a step back and reconsider uploading anything on the digital space. These days, my newly created social media accounts are merely a digital portfolio of my past works and I try my best to keep it at that. By approaching these platforms with intention, the least I can do is minimise the risk of falling into <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\">.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">The normalisation of <\/span><i><span data-contrast=\"auto\">ujub <\/span><\/i><span data-contrast=\"auto\">in this contemporary world we live in is a complex and pervasive issue. From social media and self-branding to materialism and individualism, the forces that drive us toward self-admiration are many. However, I believe it’s possible to resist these pressures. It’s no easy feat, but it is a journey worth taking.<\/span><span data-ccp-props=\"{}\"> <\/span>\n\n<span data-contrast=\"auto\">In the end, <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\"> is not just about self-admiration; it’s about losing sight of what truly matters. When I focus on myself at the expense of my relationship with the Divine, I miss out on the deeper connections and spiritual growth that life has got to offer. By striving to recognise and counter the <\/span><i><span data-contrast=\"auto\">ujub<\/span><\/i><span data-contrast=\"auto\"> in my own heart, I hope to walk a path of humility, sincerity and service to others. It is a lifelong endeavour that requires me to stay vigilant and committed to self-improvement – one I am still struggling with. In doing so, I aim to transform not just myself, but also contribute to a culture that values humility, empathy and collective well-being over self-glorification.<\/span>\n\n<hr \/>\n\n<em><span class=\"TextRun SCXW145139609 BCX8\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\"><span class=\"NormalTextRun SCXW145139609 BCX8\">Aric Hidir Amin is a versatile actor known for roles in 7 Letters, HBO's Folklore and Devoted on VIU. His work in Mediacorp's S.P.Y earned him a 2022 Asian Academy Awards nomination. Winner of the 2020 NYFA Best Actor award, Aric aims to spend his later years writing and producing stories that advocate for social mobility. <\/span><\/span><\/em>","post_title":"Normalisation of Ujub in the Contemporary World: A Personal Reflection","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"normalisation-of-ujub-in-the-contemporary-world-a-personal-reflection","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:39","post_modified_gmt":"2025-01-27 05:08:39","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4905","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4898","post_author":"216","post_date":"2025-01-27 13:08:12","post_date_gmt":"2025-01-27 05:08:12","post_content":"<span data-contrast=\"auto\">It isn’t easy to imagine modern life without smartphones. For many of us, particularly young people, these devices are almost always within arm’s reach, with messages and updates that seem impossible to ignore. They have changed how we talk to friends, learn, and even spend idle moments like waiting in queue for coffee.<\/span> <span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">In many ways, smartphones behave like a “hedonic treadmill” for the digital age. Each ping provides a brief jolt of novelty or validation, yet that feeling fades swiftly and leaves us wanting the next notification. Jonathan Haidt, known for <\/span><i><span data-contrast=\"auto\">The Coddling of the American Mind<sup>[1]<\/sup>, has examined how this constant chase for digital rewards influences younger generations. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><\/i><!--more-->\r\n\r\n<span data-contrast=\"auto\">This article is a closer look at the main issues associated with smartphone use – from mental health challenges to academic distraction – and how more conscious choices can help us embrace the advantages of technology without relinquishing genuine human connection.<\/span> <span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Growing Mental Health Pressures<\/span><\/b><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Data from the American College Health Association shows that anxiety among undergraduates has risen by 134% since 2010, while depression diagnoses have increased by 106%. Although many factors are at play, researchers point to smartphone use as a key contributor. Sohn et al. report that around 23.3% of children and young people fall into the “problematic smartphone use” category, where individuals are significantly more likely to face depression, anxiety, chronic stress, and disordered sleep<sup>[2]<\/sup>. Goswami and Deshmukh further argue that smartphone addiction can lead to loneliness, exposing the paradox of a device meant to connect people but isolating them instead<sup>[3]<\/sup>.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<img class=\"aligncenter size-medium wp-image-4903\" src=\"https:\/\/saifsmiles.link\/karyawan\/wp-content\/uploads\/2025\/01\/Screenshot-2025-01-27-100521-300x208.png\" alt=\"\" width=\"450\" height=\"312\" \/>\r\n\r\n<span data-contrast=\"auto\">Haidt claims that the device-in-hand model magnifies social media’s damaging effects. Platforms like Instagram and TikTok encourage endless scrolling and constant check-ins, which can steer users toward social comparison. Adolescents still forging their identities are especially at risk. Haidt and Lukianoff note that around 2010, younger teens swarmed these platforms, and at the same time, youth mental health indicators began to dip sharply<sup>[4]<\/sup>. The stream of stimulation, the pursuit of “likes,” and the performance mentality can erode self-esteem.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Although we may blame our phone habits on personal willpower, design features embedded in apps and devices also play a significant role. Elements such as infinite scrolling, intermittent notifications, and autoplay videos are not accidental – they are carefully engineered to keep us engaged. Social media platforms often use the same psychological principles found in gambling, where users pull down to refresh in the same way slot machines are pulled for the chance of a reward.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><span data-contrast=\"auto\">A well-known case involves the introduction of infinite scroll by software designer Aza Raskin, substantially increasing time spent on news feeds. Another example is the autoplay function on platforms like YouTube or Netflix; viewers often let multiple episodes roll by without consciously deciding to continue. These “sticky” design elements can intensify the “hedonic treadmill” effect as we search for the next small burst of satisfaction.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Constant connectivity can create what is described as heightened vigilance and ‘fear of missing out’ (FOMO). Adolescents who form excessive phone habits often report high-stress levels and difficulty “switching off,” missing out on genuine mental downtime. Haidt links social media use to anxiety by noting how each post can become a public measure of popularity and approval. When the online response falls short, self-doubt can spiral.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Research from the US National Survey on Drug Use and Health reveals that between 2010 and 2020, anxiety levels among 18–25-year-olds soared by 139%, while those aged 26–34 saw a 103% jump. By contrast, adults aged 35–49 experienced smaller increases, and some data indicate that those over 50 may have slightly lower anxiety rates now than a decade ago. Many point to tech habits as a prime reason – people who grew up immersed in smartphone culture appear more prone to digital overload.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<img class=\"aligncenter size-medium wp-image-4902\" src=\"https:\/\/saifsmiles.link\/karyawan\/wp-content\/uploads\/2025\/01\/Screenshot-2025-01-27-100210-300x212.png\" alt=\"\" width=\"450\" height=\"318\" \/>\r\n\r\n<b><span data-contrast=\"auto\">Social Disconnect in a Hyperconnected World<\/span><\/b><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Smartphones have broadened our social reach far beyond what was possible two decades ago. Users can stay in touch with distant relatives, join online groups, and discover new interests. Technology can boost “digital competence,” helping less outgoing teens find friends or explore niche pursuits. At the same time, too much reliance on digital platforms can carry psychological drawbacks<sup>[5]<\/sup>.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Constantly checking one’s phone while talking to someone else can dilute face-to-face communication. Even when people share a physical space, their attention drifts to the screen, undermining trust and empathy. Al-Kandari and Al-Sejari discovered that when phone use becomes addictive, users report a greater sense of social isolation and less support from friends<sup>[6]<\/sup>. Authentic human contact fosters emotional resilience, which may not naturally emerge through online exchanges. Teenagers who have grown up with little experience of life without smartphones may miss crucial lessons about in-person communication and conflict resolution.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Academic Distractions and Physical Effects<\/span><\/b><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Smartphones also influence the classroom. Many students say they rely on these devices to stay organised, look up resources, and coordinate group tasks. However, they can sabotage academic success when distraction wins out; incessant notifications, social media alerts, and online entertainment undermine focus, sapping time and energy.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Late-night scrolling creates additional problems by disrupting sleep. Students who are short on rest find it challenging to concentrate in lectures or when studying. Ricoy et al. point out that if phone use starts early, problematic habits can become deeply ingrained when people reach university<sup>[7]<\/sup>. Even primary school children can develop tendencies that resemble smartphone addiction, potentially affecting emotional development and causing future academic difficulties<sup>[8]<\/sup>.<\/span>\r\n\r\n<span data-contrast=\"auto\">Discussions about smartphones often emphasise mental health or social risks, but physical health can suffer as well. Prolonged neck flexion (“text neck”) results in muscle strain and reduced lung capacity – looking down at a screen for hours on end can translate into chronic neck and shoulder discomfort over time<sup>[9]<\/sup>.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Excessive phone use also coincides with lower levels of physical activity; instead, people who might engage spend that time scrolling<sup>[10]<\/sup>. Pairing late-night phone sessions with early-morning commitments encourages insomnia and fatigue. Haidt observes that even small changes – like walking down the street with eyes glued to a screen – pull people out of their surroundings, diminishing awareness and spontaneity<sup>[11]<\/sup>.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Building a Healthier Digital Culture<\/span><\/b><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">It is impractical to expect everyone to abandon their smartphones. The goal is to use them sensibly, balancing convenience with an awareness of how overreliance can damage one's well-being. Smartphones can be indispensable for specific tasks, yet their constant presence can overwhelm them.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Haidt suggests that society has become more anxious and less resilient. Smartphones provide instant reassurance but also magnify comparison, drama, and information overload. Talking openly about these challenges can help the rising generation develop healthier coping skills.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Universities might offer workshops on digital mindfulness, and halls of residence could create communal spaces where phone use is limited. Families can agree on times to set devices aside, making room for proper conversation or shared pastimes. Friend groups might support each other by spotting signs of stress and suggesting digital breaks.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Smartphones are powerful tools that can both broaden horizons and trap users in cycles of self-doubt. To strike a healthier balance, we must be deliberate and guided by evidence on how digital behaviour becomes detrimental. By supporting real-world activities, practical device boundaries, and a shared commitment to each other’s well-being, it becomes possible for young people to enjoy the best of smartphones while avoiding their most damaging effects.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Smartphones often feel like an unprecedented phenomenon, yet history is full of disruptive technologies that sparked both fascination and concern. The printing press in 15th-century Europe drastically altered the flow of information, and critics feared that easy access to books might cause intellectual laziness. Telegraph and telephone systems revolutionised communication in the 19th and 20th centuries, raising alarms about lost face-to-face interaction. Radio and television triggered new anxieties around passive audiences and family bonding.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">These past upheavals remind us that while each new medium creates fears and challenges, societies adapt by developing cultural norms, regulations, or educational programmes. Smartphones stand out because they blend constant connectivity with immersive, individual screens – a combination that channels powerful forms of social influence directly into one’s hand. Historical parallels show that concerns about technology are not new, but the scale and intimacy of smartphones arguably intensify the psychological and social effects more than previous inventions did.<\/span>\r\n\r\n<sup>1<\/sup><small>Haidt, J., &amp; Lukianoff, G. (2018). The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting Up a Generation for Failure.<em> Penguin Press<\/em>.<\/small>\r\n<sup>2<\/sup><small>Sohn, S., Rees, P., Wildridge, B., Kalk, N., &amp; Carter, B. (2019). Prevalence of problematic smartphone usage and associated mental health outcomes amongst children and young people: a systematic review, meta-analysis and GRADE of the evidence. <em>BMC Psychiatry<\/em>, 19. https:\/\/doi.org\/10.1186\/s12888-019-2350-x<\/small>\r\n<sup>3<\/sup><small>Goswami, S., &amp; Deshmukh, A. (2023). Effect of Smartphone Addiction on the Mental Health of Adolescents: A Literature Review.<em> Mind and Society<\/em>. https:\/\/doi.org\/10.56011\/mind-mri-124-20235<\/small>\r\n<sup>4<\/sup><small>Karabey, S., Palanci, A., &amp; Turan, Z. (2023). How does smartphone addiction affect the lives of adolescents socially and academically?: A systematic review study. <em>Psychology, Health &amp; Medicine<\/em>, <em>29<\/em>, 631–654. https:\/\/doi.org\/10.1080\/13548506.2023.2229241<\/small>\r\n<sup>5<\/sup><small>Ricoy, M., Martínez-Carrera, S., &amp; Martínez-Carrera, I. (2022). Social Overview of Smartphone Use by Teenagers.<em> International Journal of Environmental Research and Public Health<\/em>, <em>19.<\/em> https:\/\/doi.org\/10.3390\/ijerph192215068<\/small>\r\n<sup>6<\/sup><small>Al-Kandari, Y., &amp; Al-Sejari, M. (2020). Social isolation, social support and their relationship with smartphone addiction.<em> Information, Communication &amp; Society, 24,<\/em> 1925–1943. https:\/\/doi.org\/10.1080\/1369118X.2020.1749698<\/small>\r\n<sup>7<\/sup><small>Ricoy, M., Martínez-Carrera, S., &amp; Martínez-Carrera, I. (2022). Social Overview of Smartphone Use by Teenagers.<em> International Journal of Environmental Research and Public Health, 19.<\/em>\r\nhttps:\/\/doi.org\/10.3390\/ijerph192215068<\/small>\r\n<sup>8<\/sup><small>Cho, K., &amp; Lee, J. (2017). Influence of smartphone addiction proneness of young children on problematic behaviours and emotional intelligence: Mediating self-assessment effects of parents using smartphones. <em>Comput. Hum. Behav., 66<\/em>, 303–311. https:\/\/doi.org\/10.1016\/j.chb.2016.09.063<\/small>\r\n<sup>9<\/sup><small>Tanveer, F. (2023). The Effects of Smartphones on Child Health. T<em>HE THERAPIST (Journal of Therapies &amp; Rehabilitation Sciences).<\/em> https:\/\/doi.org\/10.54393\/tt.v4i04.53<\/small>\r\n<sup>10<\/sup><small>Ratan, Z., Parrish, A., Alotaibi, M., &amp; Hosseinzadeh, H. (2022). Prevalence of Smartphone Addiction and Its Association with Sociodemographic, Physical and Mental Well-Being: A Cross-Sectional Study among the Young Adults of Bangladesh. <em>International Journal of Environmental Research and Public Health, 19.<\/em> https:\/\/doi.org\/10.3390\/ijerph192416583<\/small>\r\n<sup>11<\/sup><small>Haidt, J., &amp; Lukianoff, G. (2018). The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting Up a Generation for Failure. <em>Penguin Press.<\/em><\/small>\r\n\r\n<hr \/>\r\n\r\n<em><span class=\"TextRun SCXW145139609 BCX8\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\"><span class=\"NormalTextRun SCXW145139609 BCX8\">Azeem Sulehri<\/span><\/span><span class=\"TextRun SCXW145139609 BCX8\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\"><span class=\"NormalTextRun SCXW145139609 BCX8\"> is a Research Analyst at RIMA. He completed his undergraduate studies in Political Science and has experience working with the government and in tech. He is interested in longevity research, South Asian literature, and <\/span><span class=\"NormalTextRun SpellingErrorV2Themed SCXW145139609 BCX8\">behavioural<\/span><span class=\"NormalTextRun SCXW145139609 BCX8\"> economics.<\/span><\/span><span class=\"EOP SCXW145139609 BCX8\" data-ccp-props=\"{&quot;134233117&quot;:true,&quot;134233118&quot;:true}\"> <\/span><\/em>","post_title":"Smartphones and the Hedonic Treadmill of the Digital Age","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"smartphones-and-the-hedonic-treadmill-of-the-digital-age","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:12","post_modified_gmt":"2025-01-27 05:08:12","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4898","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4890","post_author":"234","post_date":"2025-01-27 13:08:15","post_date_gmt":"2025-01-27 05:08:15","post_content":"<i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">written by Professor Syed Hussein Alatas is a profound piece of text which highlights the dangers of intellectual imperialism that one unknowingly adopts in their pursuit of knowledge. This book was written with the purpose of criticising the phenomenon of intellectual imperialism and highlighting its implications. First published in 2000, the book dissects the definition, traits and problems associated with intellectual imperialism. Within the context of Southeast Asia, the book also provides insights into the relationship or parallels drawn between political imperialism (involving the control of Southeast Asia by the West) and intellectual imperialism. <\/span><span data-ccp-props=\"{}\"> <\/span><!--more-->\r\n\r\n<span data-contrast=\"auto\">This review seeks to explore the definition, characteristics of the phenomenon of intellectual imperialism along with the problems that arise from it, strengths and limitations of <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">and its relevance<\/span> <span data-contrast=\"auto\">to the Malay community in Singapore. Alatas’ work resonates deeply with the Department of Malay Studies in Singapore, with it being one of the alternative discourses created on Orientalism as part of the department’s tradition<sup>[1]<\/sup>. Similarly, Professor Farid Alatas from the department publishes articles revolving around academic dependency, intellectual decolonisation and the tradition of autonomous knowledge, thus proving how the discourse of academic imperialism is deeply rooted in the department.<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Definition of <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">In the introduction to the theory of intellectual imperialism in his article on academic dependency, Alatas includes that the phenomenon was defined by Johan Galtung as “that process whereby the centre of gravity for the acquisition of knowledge about the nation is located outside the nation itself”<sup>[2]<\/sup>.<\/span>\r\n\r\n<b><span data-contrast=\"auto\">Characteristics of <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">is structured around the six characteristics of intellectual imperialism and the two problems perpetuated from it. Alatas identifies the six characteristics as:<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n<ol>\r\n \t<li><span data-contrast=\"auto\">Exploitation: colonial powers exploit the intellect of the colonised community; data or knowledge is collected or gained by foreign scholars then processed and transcribed into books or articles back in their home country (in other words, in the country of the coloniser)<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Guidance: there are certain guidelines that the people from less developed countries have to follow, and are organised into the goals set by the colonising powers<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Compliance: the dominant power expects the subjugated people to comply to certain aspects of its life, organisation and regulations<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Secondary role: the subjugated people will not be given priority but rather play a secondary role in the control of international publications and in international conferences for example, with the excuse that it is ‘expensive’ to involve them in creative research<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Rationalisation of the civilising mission: there are discussions on developing science in less developed countries according to the model being set by the dominant powers <\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Imperialist rulers\/governors: those who govern colonised nations are of lower standards than those in their home country but are still looked upon in less developed countries for they gain knowledge in the aforementioned country and eventually act as experts in the field.<\/span><span data-ccp-props=\"{&quot;335559739&quot;:240}\"> <\/span><\/li>\r\n<\/ol>\r\n<span data-contrast=\"auto\">Alatas too, identified two problems that arise from intellectual imperialism:<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240,&quot;335559739&quot;:240}\"> <\/span>\r\n<ol>\r\n \t<li><span data-contrast=\"auto\">Academic dependency: The methodologies used by scholars in less developed countries are just mere rituals, without any innovation made on their part for they imitate the topics researched thus limiting their audience with the publication of repetitive papers or journals revolving around the same topics repeatedly. This is seen as intellectual servitude and dependency. As for intellectual bondage, one would believe a certain stereotype without any research done on their part, thus restricting their intellect. Imitation comes in the form of writing and the choice of topic, making one estranged from their own intellectual traditions and experiencing the lack of interest and confidence in the past. This, therefore, leads them to perceive that there is no value in learning from Asian countries.<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Intellectual comprador and the need for a separation: Local scholars are deemed as ‘traitors’ for they are paid to provide data to foreign scholars, who would then process and publish the aforementioned data in a form unrecognisable to the ‘traitor’, who, in turn, neither has any idea of the presence of the end product or get involved in the writing or publishing process; Alatas provides examples which highlight the main idea of one’s own country’s history being seen and written from a different lens. This, however, is not seen in Western countries as a Japanese or Indian will never be seen paying an American scholar to provide them with data which they would then transcribe into an end product distributed in Japan or India respectively. A notable example given by Alatas is the fact that Americans write their own history while Southeast Asians do not. <\/span><span data-ccp-props=\"{&quot;335559739&quot;:240}\"> <\/span><\/li>\r\n<\/ol>\r\n<span data-contrast=\"auto\">Alatas’ analysis spans several chapters, each focusing on specific themes:<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240,&quot;335559739&quot;:240}\"> <\/span>\r\n<ol>\r\n \t<li><span data-contrast=\"auto\">The parallels between political imperialism and intellectual imperialism: The six characteristics of intellectual imperialism are linked and related to political imperialism.<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">The two problems that arise from intellectual imperialism: (a) intellectual servitude and dependency, bondage and imitation and (b) intellectual comprador and the need for separation<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">The continuity of intellectual imperialism: intellectual imperialism is not a new phenomenon but rather one perpetuated by the imperialistic practices adapted to the modern age<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Intellectual imperialism and the captive mind: The captive mind is a product of the mind that seeks knowledge from institutions that breed its students to imitate others and are controlled by the Western way of thinking, hence resulting in a non-creative mind equipped with the inability to produce an original problem. The intellectual dependency on present-day stereotypes and the inability to separate the specific course of things from the general is also a characteristic of a captive mind. Other forms of the captive mind include: seeing things in fractions, being alienated from the bigger problems of society and separated from his own intellectual goals, ignorance towards its own captive state of mind, incapability to be examined quantitatively but rather in an empirical way and last but not least – it is the product of the dominance of the Western powers over the entire world. In this chapter, Alatas also provides salient examples that highlight the importance (for the colonial powers) of academic imperialism as a force that moulds and shapes peoples’ way of thinking according to the imperialists.<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Intellectual emancipation: one has to free their mind from the shackles of intellectual imperialism to exponentially develop the tradition of creative and free social sciences in a developing nation.<\/span><span data-ccp-props=\"{&quot;335559739&quot;:240}\"> <\/span><\/li>\r\n<\/ol>\r\n<span data-contrast=\"auto\">There’s an overarching theme of historical journals and articles at the heart of intellectual imperialism. Alatas effectively conveys the peculiarity in allowing one’s mind to be dominated by the West, as it results in one's own history being rewritten and published by the West.<\/span><span data-ccp-props=\"{&quot;335559738&quot;:240,&quot;335559739&quot;:240}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Strengths of <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Concrete solutions to solve the problem of the lack of drive or motivation that stems from intellectual imperialism are provided. Such solutions are listed as follows:<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n<ol>\r\n \t<li><span data-contrast=\"auto\">Being critical towards writers in general, including foreign writers<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Shifting one’s attention to individual research topics<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Not evaluating oneself according to foreign standards<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n \t<li><span data-contrast=\"auto\">Instil individuality and independence in oneself<\/span><span data-ccp-props=\"{}\"> <\/span><\/li>\r\n<\/ol>\r\n<span data-contrast=\"auto\">Secondly, <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">has relevance to postcolonial studies. Alatas provides insightful and profound links to postcolonial studies. Last but not least, Alatas’ provides emphasis on intellectual dependency, where he emphasises the danger of intellectual imperialism on local scholars as it diminishes their creativity. <\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Limitations of <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">The book, too, has its limitations. There is limited focus on non-Western intellectual traditions. The idea that the Western powers collect data from less developed countries, process the data into journals or publications in their home country then distribute and sell them in the respective country they made their research in is often repeated throughout the book. Additionally, the concept of individuals from less developed countries (who possess knowledge in their area of expertise) not having the knowledge to write essays or publish their own articles is repetitive. Focus on non-Western intellectual traditions such as methods non-Westerners use to do their findings or research are limited. <\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">How the Potential of <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><\/b><b><span data-contrast=\"auto\">can be Further Stretched<\/span><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">As someone deeply impressed by Professor Syed Hussein Alatas's extensive knowledge and masterful writing, I approach this with great respect for their scholarship. As a Gen Z currently undertaking pre-university studies, something I had hoped to see in <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">is solutions on how today’s youths can tackle the challenge of preserving or enriching one’s creativity in the pursuit of knowledge amidst the rise of technological advancements, but it is not to be fret upon since the book was published in the year 2000. Hence, I opine that the potential of <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">can be further stretched by inviting prominent scholarships (that have been influenced by Alatas’ School of Autonomous Knowledge) such as Professor Farid Alatas, Dr. Azhar Ibrahim, Noor Aisha and Shaharuddin Maaruf to write an excerpt or two at the back of <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">on how today’s seekers of knowledge can dismantle the captive mind and strengthen their creativity despite the rise in technological advancements such as AI. Such applications, namely ChatGPT, MetaAI and many more have provided users with shortcuts to problems, whether it be in academic fields or not. This is not to say that I completely discourage the use of AI in one’s studies since I implement it in my own learning, but rather, I believe that students of this age have the potential to outdo these artificial minds. AI provides lengthy paragraphs rich in vocabulary when one seeks for it to write an essay for them, thus setting a ‘standard’ to the user, leading them to think that their own work can only be deemed good when aligned with the standards set by AI. Alatas emphasises in <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><span data-contrast=\"auto\"> that a written piece of work is good, regardless of whether it is published in the West or not. In a similar vein, one should not heavily rely on the use of AI, because their work has its own uniqueness and does not need to conform to the standards set by AI. However, with the acceleration of the pace of life, AI has been central in our lives such that its use is inescapable. Hence, having the input of the aforementioned scholars could provide valuable insights on how youths can prevent their minds from being overcome by AI and discuss the problems and ethical aspects of the use of AI as well as the importance of maintaining intellectual integrity.<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Relevance to the Malay Community in Singapore<\/span><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">is relevant to the Malay community in Singapore as the phenomenon impacts cultural and language preservation. The choice of English as the lingua franca relegated Malay to a secondary position such that the Malay language has limited prominence in public life (despite it being the national language of Singapore), impacting cultural identity and self-esteem within the community. In addition to that, Alatas’ critique further proves the need for the Malay community in Singapore to reclaim their intellectual and cultural agency, by promoting Malay studies and fostering a deeper appreciation for the language among Malay youths in Singapore and appreciation for Malay contributions to Singapore’s history and development. Malay scholars, writers and educators should be given support to ensure that the community’s perspectives are represented and considered in national and academic discourses, thus challenging intellectual imperialism.<\/span><span data-ccp-props=\"{}\"> <\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">My personal reflections on <\/span><\/b><b><i><span data-contrast=\"auto\">Imperialism Intelektual<\/span><\/i><\/b><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">During my immersion trip in Sarawak as part of my Malay Language Elective Programme at the Pre-University Level (MLEP-JC), I was exposed to the culture, language and literature of the different ethnic groups in Sarawak – Iban, Melanau, Orang Ulu, Bidayuh, etc. On one of the nights, our teachers debriefed us, relating the activities for the day to the concept of ‘the captive mind’, and the thought of Alatas’ ideas in <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual <\/span><\/i><span data-contrast=\"auto\">came to mind. It was beautiful to see the pride the different ethnic groups had of their identity, and how their respective languages are still entrenched in their day-to-day lives – an example would be the <\/span><i><span data-contrast=\"auto\">Berita Iban <\/span><\/i><span data-contrast=\"auto\">segment on the TV Sarawak channel, i.e. news documented and relayed in the Iban language. Our teachers taught us that this was only possible because they had freed themselves from the captive mind, thus enabling them to preserve their cultures, language and identities. This, therefore, serves as a reminder that we, as Malays, should free ourselves from the captive mind, in order to truly preserve our culture, language and literature, for it to remain deeply rooted in the lives of the generations to come.<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<b><span data-contrast=\"auto\">Conclusion<\/span><\/b>\r\n<span data-contrast=\"auto\">In conclusion, <\/span><i><span data-contrast=\"auto\">Imperialisme Intelektual<\/span><\/i><span data-contrast=\"auto\"> by Professor Syed Hussein Alatas is an essential contribution to understanding the pervasive issue of intellectual imperialism, particularly in the postcolonial Southeast Asian context. By dissecting its characteristics, implications, and continuity, Alatas not only critiques the dominant paradigm but also offers actionable solutions to empower local scholars and resist the pervasive influence of Western-centric intellectual traditions. It is a compelling call for intellectual liberation, urging scholars and communities to reclaim their agency, celebrate their heritage, and chart an independent course in the global landscape of knowledge and culture.<\/span><span data-ccp-props=\"{}\"> <\/span>\r\n\r\n<sup>1<\/sup><small>Alatas, S. F. (2018). “Silencing as Method”: Leaving Malay Studies Out. <em>In Department of Malay Studies, National University of Singapore, Department of Malay Studies, National University of Singapore [Report].<\/em> https:\/\/fass.nus.edu.sg\/mls\/wp-content\/uploads\/sites\/13\/2020\/07\/Alatas.SilencingasMethod-2-4-13795-Final1.pdf<\/small>\r\n\r\n<sup>2<\/sup><small>Alatas, S. F. (2022). Political Economies of Knowledge Production: On and Around Academic Dependency. <em>Journal of Historical Sociology, 35<\/em>(1), 14–23. https:\/\/doi.org\/10.1111\/johs.12362<\/small>\r\n\r\n<hr \/>\r\n\r\n<i><span data-contrast=\"auto\">Haziqah Binte Rafiee, a Pre-University 2 student at Raffles Institution, is an active member of the Malay Language Elective Programme and Malay Cultural Society. She celebrates her culture through writing and debate, including her teams' 2024 Bahas 4PM victory. Haziqah also writes poetry with the RI Writers' Guild and shares her work through MudaSG and her Substack.<\/span><\/i>","post_title":"Book Review: Imperialisme Intelektual by Syed Hussein Alatas","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"book-review-imperialisme-intelektual-by-syed-hussein-alatas","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:15","post_modified_gmt":"2025-01-27 05:08:15","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4890","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"1"},
{"ID":"4889","post_author":"217","post_date":"2025-01-27 13:08:08","post_date_gmt":"2025-01-27 05:08:08","post_content":"<span data-contrast=\"auto\">Emerging from the vibrant cultural shifts of the 60s, dangdut is a popular and widely cherished Indonesian music genre rooted in grassroots communities. The name itself is onomatopoeic, derived from the drum sounds “dang” and “dut” — commonly heard in its music. Dangdut typically features traditional instruments like the <\/span><i><span data-contrast=\"auto\">gendang<\/span><\/i><span data-contrast=\"auto\"> (a traditional wooden drum), with modern ones like the electric guitar and keyboard. The flute and violin are also frequently included, adding melodic depth. The genre has spawned numerous subgenres across the decades, including <\/span><i><span data-contrast=\"auto\">koplo, gondang, pantura, electro, rockdut<\/span><\/i><span data-contrast=\"auto\">, etc. Despite the diverse subgenres, the most important common feature across all subgenres is the drums. One of the hallmarks of dangdut is its rhythmic structure, characterised by syncopation that creates this irresistibly danceable groove. The dynamic rhythm of dangdut invokes movements and mirrors the lively energy of the genre, making it not just a form of musical expression, but a communal experience. This infectious quality of dangdut’s groove will remain a central theme explored throughout the article — delving deeper into the evolution of dangdut throughout the decades and its impact on society across different eras. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<!--more-->\r\n\r\n<span data-contrast=\"auto\">Rhoma Irama, often referred to as the “King of Dangdut”, played a key role in shaping and popularising the genre. Disenchanted with Western rock music, he was on a quest to develop a new musical style by the early 1970s. His songs are more rock-oriented with an electrified dangdut style as he combined different elements that exist in Malay, Indian and Middle Eastern music. His career trajectory and music were pretty interesting as he wrote more about love in his earlier career days. After returning from his pilgrimage, he started to write lyrics to talk about social issues and to spread the word of Islam. Subsequently, he wrote lyrics in relation to moral laxity, human rights abuses, social inequality and many more<sup>[1]<\/sup>. Noting that dangdut was predominantly popular within the lower and working class, the topics covered in his songs offered an intriguing perspective, which was contrary to the upper class’ view of the genre as being unrefined, vulgar, and corruptive to the country’s social values. This inadvertently accentuated the irony of the disparity between the rich and the poor. Consequently, the emergence of low culture versus high culture; where dangdut is a communal experience for the working class and it was important to note that it was cheap, or rather free — due to an increase of pirated VCDs back then. Dangdut being a cheap thrill was not the only reason why it was considered low culture. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">As more elements of style of music were incorporated into dangdut, the dangdut <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> subgenre rose in popularity in the 2000s, incorporating even more influences from rock, electronica, hip hop and pop. As much as Rhoma Irama changed the dangdut scene with incorporation of rock elements, Inul Daratista was no stranger to that. She was considered the precursor of <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\">, playing a pivotal role in this transformation with her provocative performances that challenged the conventions of ‘classic dangdut’. The defining feature of dangdut <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> is the speed and complexity of its rhythms, which are distinctly faster than those of traditional dangdut, enticing people to move and dance along to its tunes. The genre derives its name from the slang term “<\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\">” which refers to a cheap hallucinogenic drug commonly sold in Indonesia. Since <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> is played at a faster tempo, it is said to make listeners feel “high”, hence giving the same effect as “<\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> pills”. <\/span><i><span data-contrast=\"auto\">Koplo<\/span><\/i><span data-contrast=\"auto\"> was often distanced from traditional dangdut practitioners. Even Rhoma Irama expressed his own concerns about Inul Daratista, particularly her signature dance move known as “<\/span><i><span data-contrast=\"auto\">ngebor” <\/span><\/i><span data-contrast=\"auto\">or “drill”. He asserted that it was inappropriate and could degrade moral values in Indonesia, especially owing to the fact that Indonesia is a predominantly Muslim country with conservative cultural norms. Evidently, Inul’s performances sparked significant media attention and public discourse. It was to the point that Inul’s dancing became a focal point in debates surrounding religion, culture and politics — sparking conversations about how human bodies imbued with various meanings and values have powerful implications for discourses about Islam, pornography, women’s bodies and changing forms of media<sup>[2]<\/sup>. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">On top of that, dangdut experts mentioned that Inul’s performances are far from what ‘real’ dangdut is, as performed in rural East and Central Java. However, there are anecdotes from Indonesian locals who mentioned that singers who perform in small towns and villages tend to use erotic and sexy moves. With that in mind, dangdut performances were a hit at Indonesian weddings, local markets and informal gatherings, where the whole neighbourhood would turn up to see the show and young children were allowed to stay up late to watch<sup>[3]<\/sup>. This is where the distinction between low culture and high culture comes to play again — dangdut was something that could appeal to the masses in villages and was heavily scrutinised by more conservative and elite segments of the society due to the ‘vulgarity’ of their performances. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Despite the concept that dangdut is ‘sinful’ and that one should not indulge in the genre, dangdut <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> can also be seen as a celebration of Indonesian culture and heritage. Through its lively performances, it honours the rich traditions and spirited essence of the nation. It didn’t take long until dangdut also swept the feet of their neighbouring countries — Malaysia and Singapore. In Singapore, dangdut’s presence first emerged around the late 70s and 80s. Back then, dangdut in Singapore was popularised through social gatherings, live performances and nightclubs that catered to the Malay community. Local events featuring dangdut bands or singers became a common way for fans to enjoy the genre. Singaporeans often consumed dangdut music through radio broadcasts, cassette tapes, and later CDs, many of which were imported from Indonesia and Malaysia. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Similarly, conservative segments of the community sometimes criticised dangdut performances for their perceived sensuality, reflecting similar tensions seen in Indonesia. Gathering anecdotes from the older generation, it seems that dangdut had a negative stereotype as it was associated with Malay men going to nightclubs to enjoy dangdut — a term I would hear often was '<\/span><i><span data-contrast=\"auto\">pakcik menggatal<\/span><\/i><span data-contrast=\"auto\">’ (which translates to flirty uncle)<\/span><i><span data-contrast=\"auto\">. <\/span><\/i><span data-contrast=\"auto\">Fast forward to today, dangdut in Singapore remains a niche genre, enjoyed mostly by the Malay community and often celebrated during cultural events or private gatherings. It also maintains a presence through modern digital platforms like Spotify, YouTube and even TikTok<\/span><b><span data-contrast=\"auto\">.<\/span><\/b><span data-contrast=\"auto\"> Early last year, there was a “Dangdut Koplo Extravaganza!” concert by Ochi Alvira and Syahiba Saufa at Esplanade, and tickets were sold out. This is all thanks to their immense following on various media platforms. With a combined following of over five million followers on TikTok and Instagram, international viral hits like <\/span><i><span data-contrast=\"auto\">Rasah Nyangkem 3, <\/span><\/i><span data-contrast=\"auto\">and millions of views on YouTube, Ochi and Syahiba have cemented their status as stars with distinct appeal. Their musical chemistry has undoubtedly established them as iconic figures in the current dangdut scene. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">As the genre continues to evolve constantly, this is where we are able to observe dangdut being more receptive and we are now in the <\/span><i><span data-contrast=\"auto\">Jedag Jedug<\/span><\/i><span data-contrast=\"auto\"> era. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">The turn of the 21st century saw another significant shift in dangdut’s evolution, marked by the influence of electronic dance music (EDM) and modern pop. This period, often referred to as the <\/span><i><span data-contrast=\"auto\">Jedag Jedug<\/span><\/i><span data-contrast=\"auto\"> era, introduced more fast-paced beats, electronic synths, and a greater focus on digital production. Artists like Inul Daratista and Nella Kharisma (dangdut and <\/span><i><span data-contrast=\"auto\">koplo<\/span><\/i><span data-contrast=\"auto\"> singer) began incorporating electronic elements, creating a new, electrifying sound that appealed to younger generations. Indonesian DJs like Alva Kenzo, DJ Jedag Jedug, and Maman Fvndy have curated their own playlists of remixed tracks. With the incorporation of auto-tune, drum machines, and electronic beats, they have transformed dangdut into high-energy, crowd-pumping anthems. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">According to my readings of both academic and non-academic articles, it seems like dangdut is gaining an increasingly better reputation, owing to the fact that the stigma associated with listening to dangdut or watching a dangdut performance has dissipated, contributing to a cultural rejuvenation. On the flip side, going back to how the old stereotype of dangdut was about ‘<\/span><i><span data-contrast=\"auto\">pakcik menggatal<\/span><\/i><span data-contrast=\"auto\">’, it has now evolved to the younger generations, where mostly ‘<\/span><i><span data-contrast=\"auto\">mat and minah<\/span><\/i><span data-contrast=\"auto\">’<sup>[4]<\/sup> listen to the genre. As TikTok videos and Instagram reels continue to rise in popularity, thanks to their short video format, many creators can be seen dancing to trending or indie songs, sharing memes, posting short holiday vlogs, and showcasing their talents, among other content. In relation to dangdut, <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> was first popularised on TikTok, with social media users showcasing their motorcycles in CapCut<sup>[5]<\/sup> edited videos — users would use <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> music to edit their videos in a unique way, syncing the photos with the beats of the music. It then expanded to dancing, showing a compilation of selfies, celebrity fan edits, promotional videos and many more. Some would find these videos fun and cool, and some would find the editing and song choice to be awfully tacky. Regardless, it is inevitable to acknowledge that these TikTok videos are increasingly making dangdut popular among the younger generations. In a study that was done in Indonesia, it was found that TikTok actually plays an important role in making <\/span><i><span data-contrast=\"auto\">jedag jedug <\/span><\/i><span data-contrast=\"auto\">popular. Comments presented in the study vary from “loud and enjoyable”, “the remix is interesting”, “Indonesian people are creative, they can remix all the songs, even sad songs” to “I associate jedag jedug with <\/span><i><span data-contrast=\"auto\">jamet”<sup>[6]<\/sup>. <\/span><i><span data-contrast=\"auto\">Jamet<\/span><\/i><span data-contrast=\"auto\"> is an Indonesian slang that is usually associated with people who are weird and tacky. This is where we observe similar tensions when it comes to stereotypes surrounding <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\">. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span><\/i>\r\n\r\n<span data-contrast=\"auto\">Through conversations with the younger generation and ‘doom scrolling’ of TikTok, it seems like<\/span><i><span data-contrast=\"auto\"> jedag jedug<\/span><\/i><span data-contrast=\"auto\"> is considered low culture, due to the perceptions of who would upload a <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> video. In a recent <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> video that was circulated on TikTok, two students were seen dancing to <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> in their uniforms. Unfortunately, due to the distinctive nature of their uniforms, people were commenting on the irony of students from a prestigious, elite school engaging in activities typically associated with neighbourhood school students. Some even commented, ‘<\/span><i><span data-contrast=\"auto\">mat<\/span><\/i> <i><span data-contrast=\"auto\">minah dah pandai seh’<\/span><\/i><span data-contrast=\"auto\">,<\/span> <span data-contrast=\"auto\">which translates to ‘mat and minah are already clever people’. This reflects the stereotype that in Singapore’s youth culture, dangdut\/<\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> is associated exclusively with a particular subculture — a subculture that is usually associated with certain styles, attitudes, or behaviours that some perceive as less polished or mainstream. This incident underscores the broader stereotype within Singapore’s Malay youths, where <\/span><i><span data-contrast=\"auto\">jedag jedug<\/span><\/i><span data-contrast=\"auto\"> is often exclusively associated with a particular demographic. Such associations perpetuate a class divide within the Malay society, where certain forms behaviours or self-entertainment are seen as inherently tied to socioeconomic or educational backgrounds. While some may view this stereotyping as harmless and humorous, it accentuates the deeper societal biases that exist within the Malay community. The irony of elite school students engaging in this form of entertainment forces a reexamination of these cultural hierarchies and challenges the idea that certain forms of expression belong exclusively to any one group. This is where labelling theory comes into play where these stereotypes instill a stigma to a subculture, leading them to experience social withdrawal and low self-worth. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">The evolution of dangdut from <em>Gelek<\/em> to <em>Jedag Jedug<\/em> reflects the genre’s adaptability in the face of shifting cultural, technological and social influences. From its roots in traditional Indonesian music to embracing electronic beats, dangdut has consistently mirrored the changing tastes and identities of the masses in Indonesia, Malaysia, Singapore and maybe even other countries. Although some purists argue that the incorporation of electronic and pop elements dilutes dangdut’s traditional charm, dangdut is still able to symbolise Indonesia’s rich heritage and its ever-changing genre that flows with the times. I for one believe that the genre’s ability to evolve and adapt suggests a promising future. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">On the argument that <\/span><i><span data-contrast=\"auto\">jedag jedug <\/span><\/i><span data-contrast=\"auto\">should be a fun thing, and not a catalyst to stereotyping people, I honestly am a proponent of the notion that music knows no boundaries and that it should not be a genre that creates these stereotypes amongst the Malay community. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6}\"> <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span>\r\n\r\n<sup>1<\/sup><small>Gorlinski, V. (2024). Rhoma Irama.<em> Britannica<\/em>. https:\/\/www.britannica.com\/biography\/Rhoma-Irama<\/small>\r\n<sup>2<\/sup><small>Weintraub, A. (2008). ‘Dance drills, faith spills’: Islam, body politics, and popular music in post-Suharto Indonesia. <em>Popular Music, 27<\/em>(3), pp. 367-392. https:\/\/doi.org\/10.1017\/S0261143008102185<\/small>\r\n<sup>3<\/sup><small>Vaswani, K. (2012). Raunchy dangdut music stirs debate in Indonesia. <em>BBC News<\/em>.<\/small>\r\n<sup>4<\/sup><small>Colloquial terms of a Malay youth subculture<\/small>\r\n<sup>5<\/sup><small>CapCut is a mobile video-editing app with various templates to choose from<\/small>\r\n<sup>6<\/sup><small>Tiantini, W. B., Afdholy, N. &amp; Puspita, Y. M. (2023). Jamet stereotyping in jedag-jedug music: An analysis of jedag-jedug music stereotype. <em>Jurnal Seni Musik, 12<\/em>(2). https:\/\/journal.unnes.ac.id\/sju\/index.php\/jsm\/index<\/small>\r\n\r\n<hr \/>\r\n\r\n<i><span data-contrast=\"auto\">Qamar Jannah Fateen is currently a Research Analyst at the Centre for Research on Islamic and Malay Affairs (RIMA). She holds a master's degree in international development practice, specialising in sustainable economy. Her current research interests include social inequality, cultural development and diaspora of Austronesians\/Malays. <\/span><\/i>","post_title":"From Gelek to Jedag Jedug: The Evolution of Dangdut","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"from-gelek-to-jedag-jedug-the-evolution-of-dangdut","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:08","post_modified_gmt":"2025-01-27 05:08:08","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4889","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4885","post_author":"224","post_date":"2025-01-27 13:07:00","post_date_gmt":"2025-01-27 05:07:00","post_content":"<span data-contrast=\"auto\">In the ever-changing landscape of media, technology and communication, few academics and artists embody the synergy between tradition and innovation as seamlessly as Dr Noor Hasbi Yusoff. Currently an Assistant Professor at the University of Wollongong in Dubai (UOWD), Dr Hasbi’s academic journey spans continents – from Singapore and Australia to the United Arab Emirates (UAE). Nevertheless, much of his work is rooted in his Malay-Muslim heritage and upbringing in Singapore, which profoundly <\/span><span data-contrast=\"auto\">​<\/span><span data-contrast=\"auto\">shape<\/span><span data-contrast=\"auto\">​<\/span><span data-contrast=\"auto\"> his perspective on education, identity and the arts. Dr Hasbi bridges the worlds of visual communication design and user experience with deep cultural and artistic roots through his work, which include calligraphy, calligraffiti and other forms of interactive media. Beyond his artistic endeavours, Dr Hasbi’s commitment to fostering inclusive and critical learning environments can also be seen in his global endeavours to contribute to the growing world of social semiotics and visual cultures, in his conferences in Finland, Japan and Spain. <\/span><span data-ccp-props=\"{&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0}\"> <\/span>\r\n<!--more-->\r\n\r\n<span data-contrast=\"auto\">In this interview, Dr Hasbi shares insights into his multifaceted career, the motivations behind his global journey, and thoughts on the intersections of culture, technology, and education. From mentoring students across diverse cultural contexts to navigating the challenges and opportunities of a digital age, Dr Hasbi offers a compelling narrative of resilience, adaptability and innovation. <\/span>\r\n<p data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: Could you tell us more about yourself and your family? <\/strong><\/p>\r\n<p data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> I come from a family of educators in Singapore, where education and <\/span><i><span data-contrast=\"none\">adab<\/span><\/i><span data-contrast=\"none\"> (etiquette) were deeply emphasised. As a Malay Muslim, I grew up deeply rooted in traditions and religion. My maternal grandfather, a respected religious teacher and social activist in the Arab Street\/Masjid Sultan area, profoundly influenced my worldview, demonstrating the balance between consistent religious practice and impactful worldly endeavours, particularly in the visual arts. My journey spans diverse artistic expressions, from punk rock and street art to traditional Malay arts like dance, <\/span><i><span data-contrast=\"none\">dikir barat<\/span><\/i><span data-contrast=\"none\">, <\/span><i><span data-contrast=\"none\">calligraffiti<\/span><\/i><span data-contrast=\"none\">, and art installations. My educational experiences shaped my appreciation for the learning process, emphasising growth over grades. These experiences have taken me across continents as both an academic and artist. The unwavering support of my family, particularly my wife, has been instrumental in shaping my values and achievements.<\/span><\/p>\r\n<p data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><img class=\"aligncenter size-medium wp-image-4940\" src=\"https:\/\/saifsmiles.link\/karyawan\/wp-content\/uploads\/2025\/01\/Dr-Hasbi-PHD-family-photo-300x240.jpeg\" alt=\"\" width=\"450\" height=\"360\" \/><\/p>\r\n<p style=\"text-align: center;\" data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><em>Dr Hasbi and his family, whom he describes as his pillars of support and his heart<\/em><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: What does a day in your life look like? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> A typical day begins with quiet meditation and reflection. I dedicate my mornings to reading and writing, engaging with thought-provoking ideas on media, culture, and creative practice. My academic role as an assistant professor and practice-based researcher occupies much of my day, where I explore sociocultural meaning-making through digital tools to enhance artistic expression and teaching strategies. The evening is reserved for family time, reconnecting with my roots, and maintaining the balance between professional pursuits and personal growth.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: What motivated you to pursue opportunities outside Singapore? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> There were many motivations, but primarily, I wanted to challenge myself and step outside my comfort zone. Working and living abroad allowed me to broaden my perspectives and gain invaluable experiences, particularly through interactions with diverse cultures. These experiences helped me rediscover my <\/span><i><span data-contrast=\"none\">jati diri<\/span><\/i><span data-contrast=\"none\"> (identity) as a Malay and a Muslim. It also gave me the opportunity to bring my unique identity into international conversations, fostering cross-cultural understanding.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><strong>Q: What are some of your favourite career highlights? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> One of my most memorable moments was my first solo exhibition at the Frankston Arts Centre in Victoria, Australia, in 2006, which led to my PhD scholarship at RMIT University. I curated and presented a mixed-media digital exhibition that transformed the calligraphic works of Qais Al Muhib into an interactive multimedia performance, bridging the traditional and spiritual aspects of Malay arts with modern techniques. I revisited this experience as a finalist in several international arts competitions in Dubai and the metaverse in 2022.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\">Another highlight was mentoring students from diverse cultural and educational backgrounds, guiding them through projects that challenged their worldviews and perceptions. Lastly, completing my PhD after 10 years – a study highlighting the intersection of identity, culture, and technology – stands as a testament to my commitment to meaningful and impactful scholarship.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><img class=\"aligncenter size-medium wp-image-4939\" src=\"https:\/\/saifsmiles.link\/karyawan\/wp-content\/uploads\/2025\/01\/Dr-Hasbi-Conference-photo-2-1-300x200.jpeg\" alt=\"\" width=\"450\" height=\"300\" \/><\/p>\r\n<p style=\"text-align: center;\" data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><em>Dr Hasbi unveiling the potential of AI in cultural storytelling at the Museum of the Future, Dubai<\/em><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: How do you think living and working abroad has enriched your life, both academically and personally?  <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> Living and working abroad has significantly broadened my worldview and deepened my appreciation for Malay culture and its values. Academically, it exposed me to innovative methodologies and practices, some rooted in religio-cultural traditions, which I have applied in my teaching and research. Personally, it has taught me resilience, adaptability, and the beauty of embracing diverse identities, all of which shape how I approach challenges and opportunities.<\/span>\r\n<span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<strong>Q: Do you have any experiences where your background as a Malay Muslim from Singapore provided a unique perspective in your career and\/or your everyday experiences?  <\/strong>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> Certainly. While at RMIT as a PhD candidate and academic staff, I worked on projects addressing cultural representations in interactive media. My background allowed me to bring an authentic voice to these discussions, ensuring nuanced portrayals of minority communities, particularly Malays in Singapore and Australia. In everyday life, my identity bridges gaps and fosters dialogue, as demonstrated when I wore traditional Malay attire – <\/span><i><span data-contrast=\"none\">Baju Melayu<\/span><\/i><span data-contrast=\"none\">, <\/span><i><span data-contrast=\"none\">Sampin<\/span><\/i><span data-contrast=\"none\">, and <\/span><i><span data-contrast=\"none\">Tengkolok<\/span><\/i><span data-contrast=\"none\">\/<\/span><i><span data-contrast=\"none\">Songkok<\/span><\/i><span data-contrast=\"none\"> – to lectures and presentations, sparking meaningful conversations about culture and tradition. <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: As an artist and educator, how do you balance traditional calligraphy and modern digital techniques, and are there any cultural aspects that influence your work? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> I see tradition and technology as complementary rather than opposing forces. My work often begins with traditional techniques in Malay and Arabic calligraphy, preserving its rich heritage, and evolves through digital tools and generative AI, making it relevant to contemporary audiences. Cultural elements, such as harmony and community values, are intricately woven into each piece, reflecting my identity and inspiring others to embrace their roots while innovating.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: Having worked in Monash University and RMIT, how did your experiences there prepare you for your current role at UOWD? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> Both Monash and RMIT shaped my ability to navigate multicultural and multireligious academic environments. At Monash, I honed my research and teaching skills, while at RMIT, I developed a creative pedagogy and practice-based research approach. These experiences prepared me to lead innovative projects and teach complex sociocultural subjects at UOWD, where I mentor both tutors and students in a rapidly evolving global media and design landscape.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: In the rapidly evolving fields of media and communication, what do you see as the biggest challenges and opportunities for your students and your own research? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> The biggest challenge lies in addressing ethical dilemmas in AI and media, such as misinformation and representation. However, these challenges are also opportunities to foster critical thinking and creativity. The rise of immersive media and generative AI offers exciting possibilities to explore culturally responsive storytelling, bridging cultural and technological narratives. These endeavours have allowed me to present my research and practice globally, from the UAE and Japan to Finland, Malaysia, and the metaverse. <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: What emerging trends in media, communication, or education do you think the Malay-Muslim community in Singapore should embrace to remain relevant and empowered? <\/strong><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-contrast=\"none\"><strong>Dr Hasbi:<\/strong> The community should prioritise digital and AI literacy, leveraging these tools to amplify their voices and share their stories. Platforms like social media and AI-driven storytelling through reels, podcasts, and films can connect with global audiences while showcasing heritage. Malay Muslim writers and directors, such as Muhammad Mahfuz and Razi Salam, exemplify how to balance tradition with global relevance, demonstrating the power of storytelling. <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335559739&quot;:0,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n<p data-ccp-border-bottom=\"0px none #000000\" data-ccp-padding-bottom=\"0px\" data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><strong>Q: Lastly, do you have any advice for Singaporean Malay-Muslims who are considering working and\/or studying abroad?  <\/strong><\/p>\r\n<p data-ccp-border-between=\"0px none #000000\" data-ccp-padding-between=\"0px\"><span data-contrast=\"none\">If given the opportunity, step out with confidence and an open mind. Celebrate your unique identity while embracing new experiences. Prepare thoroughly by seeking mentors, researching opportunities, and building a strong support network. Remember, each challenge abroad is a chance for growth and an opportunity to offer a fresh perspective to the world.<\/span><span data-ccp-props=\"{&quot;335559685&quot;:720,&quot;335572071&quot;:0,&quot;335572072&quot;:0,&quot;335572073&quot;:0,&quot;335572075&quot;:0,&quot;335572076&quot;:0,&quot;335572077&quot;:0,&quot;335572079&quot;:0,&quot;335572080&quot;:0,&quot;335572081&quot;:0,&quot;335572083&quot;:0,&quot;335572084&quot;:0,&quot;335572085&quot;:0,&quot;335572087&quot;:0,&quot;335572088&quot;:0,&quot;335572089&quot;:0,&quot;469789798&quot;:&quot;nil&quot;,&quot;469789802&quot;:&quot;nil&quot;,&quot;469789806&quot;:&quot;nil&quot;,&quot;469789810&quot;:&quot;nil&quot;,&quot;469789814&quot;:&quot;nil&quot;}\"> <\/span><\/p>\r\n\r\n\r\n<hr \/>\r\n\r\n<i><span data-contrast=\"auto\">Irdina Aisyah Mohd Imran is currently an undergraduate at the National University of Singapore studying English Literature and Psychology. Her research interests include cultural and historical development, in particular pertaining the Islamic and Southeast Asian. <\/span><\/i>","post_title":"From Calligraphy to the Metaverse: Dr Noor Hasbi Yusoff's Journey Through Media and Design","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"from-calligraphy-to-the-metaverse-dr-noor-hasbi-yusoffs-journey-through-media-and-design","to_ping":"","pinged":"","post_modified":"2025-01-27 13:07:00","post_modified_gmt":"2025-01-27 05:07:00","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4885","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4880","post_author":"151","post_date":"2025-01-27 13:06:32","post_date_gmt":"2025-01-27 05:06:32","post_content":"&nbsp;\r\n\r\n&nbsp;\r\n\r\n<span data-contrast=\"auto\">In recent times, we have witnessed increased output of Islamic works in English by Singaporean Muslim writers, mainly non-fictional in nature. This is different as compared to the past, where Singaporean Muslim writers would primarily write and publish Islamic works in the Malay language. It certainly reflects the changing trend within the Muslim community, where English has become – or is almost becoming – the primary language of discourse and communication in socio-religious spaces. Naturally, this trend has been translated into a rising demand for Islamic works in English. Today's popular Islamic books in Singapore are almost exclusively in English, with local writers such as Ameera Aslam, Mizi Wahid, Liyana Musfirah, being frequent names on Wardah Bookstore's bestseller lists. While the aforementioned writers primarily publish spiritual, non-fiction and self-help Islamic works, we are also seeing efforts that mainly cater to Singapore Muslims who are passionate and interested about poetry, such as Layl Ash-Shayr, an initiative by local Muslim literary advocates that frequently holds poetry and open-mic nights. Their initiatives, which include an anthology and poetry competitions, has provided an insightful window to the communal and widespread interest within the Muslim community towards poetry. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span><!--more-->\r\n\r\n<span data-contrast=\"auto\">Although it can be said that these works and initiatives by our local writers and advocates are a reflection of the rising need and demand of English Islamic works, the output is mainly poetry, spiritual, and self-help in nature. Regarding these works, there is clearly high demand as we can see from their popularity and sales numbers. However, we do see a lack of contemporary output and representation of Islamic Literature that is of a creative, literary and fictional essence, such as plays, novels and short stories. In the past when works were mainly written in Malay, there were copious number of works that can be categorised as Islamic Literature. The works of figures such as Suratman Markasan, Masuri SN, Mohamed Latiff Mohamed, Isa Kamari, Jamal Ismail, Rasiah Halil, Johar Buang, Maarof Salleh, and several others, contained Islamic elements that came in the form of both novels and short stories. It would be inaccurate to conclude without formal inquiry that the reason for this is a lack of demand and relevance for Islamic literary works of such nature, as general trend indicates that novels and short stories in general are still popular and relevant. In my opinion, what seems to be the case is a supply issue rather than demand.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Why then, do we not see a proportionate output of Islamic creative and fictional works in English, as we observe with other forms of writings? What is the importance and relevance of such works today? With Singapore's context in mind, how should we define the concept of Islamic Literature? What should be the objectives and parameters for this genre of literature? This article would not claim to be comprehensive, but rather an attempt to initiate discourse and discussion on how we can improve the ecosystem of Islamic Literature. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">The discourse on Islamic Literature, regarding its definition, importance and manifestation, can be considered as a mature discourse that goes back to the fifties with the emergence of Muslim-majority states and nations in the post-colonial period. The discourse took place throughout the Muslim world. From the Middle East and South Asia, Syed Abul Hasan Ali Hasani Nadwi (who was very much influenced by Muhammad Iqbal), Muhammad Qutub, Najib Kilani, Imad Al-Din Khalil, and Muhammad Sa'id Ramadan Al-Buti, wrote extensively on the role and concept of Islamic Literature, albeit in the context of their own societies. Though the discourse took place slightly later in the Nusantara region, it was nevertheless a lively discourse with intellectuals from Malaysia and Indonesia such as Shahnon Ahmad, Hashim Awang, Othman Kelantan, <\/span><span data-contrast=\"auto\">Kuntowijoyo, M. Fudoli Zaini, and Abdul Hadi W.M., actively engaging in the discourse through their writings. In Singapore, we had figures such as Suratman Markasan and Masuri SN who penned their ideas and thoughts on this concept.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:2,&quot;335551620&quot;:2,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">These intellectuals defined Islamic Literature differently, and certainly each writer would have their own preference. I, for one, resonate strongly with the understanding of Indonesian intellectual, Kuntowijoyo, and Malaysian intellectual, Shahnon Ahmad. Kuntowijoyo in the discourse of Islamic Literature during the seventies, advocated for what he termed as <\/span><i><span data-contrast=\"auto\">Sastera Profetik, <\/span><\/i><span data-contrast=\"auto\">or Prophetic Literature. He defined Prophetic Literature with three elements; 1) Humanisation, 2) Liberation, 3) Transcendence<sup>[1]<\/sup>. Shahnon Ahmad, on the other hand, held a more theological view of Islamic Literature, in which it is essentially another form of worship to obtain the pleasure of God. He held the view that literature is a process of creation and writing that revolves around belief in Allah, evoking a high level of devotion by the writer to delve into the concept of Islamic Creed and translating it with wisdom to readers, in line with their abilities as a writer<sup>[2]<\/sup>.<\/span>\r\n\r\n<span data-contrast=\"auto\">In the discourse of Islamic Literature, much has also been said regarding its need and importance for Muslim societies, specifically as a mode of religious advocacy <\/span><i><span data-contrast=\"auto\">(dakwah)<\/span><\/i><span data-contrast=\"auto\"> that protects Muslims from contents that are of harmful and negative influence. For example, the prominent Syrian scholar, Muhammad Sai'd Ramadan Al-Buti, in his essay titled 'Islamic Literature: Retrospection and Vision', argued that Islamic Literature should be utilised as a psychological tool to inspire and educate the masses, especially youths, regarding what is right and wrong. In the essay, he addressed the existence of works that consist of contents that may intellectually and ideologically harm readers and called for better quality and higher quantity of Islamic Literary works that are emotional and sentimental in nature. It is telling that though the essay was written in 1968, he criticised those who disagreed with the usage of sentimental concepts such as 'love', 'beauty', and 'heart', saying that Islamic aesthetics should not be defined by 'turbans, robes, long beads<sup>[3]<\/sup>.<\/span>\r\n\r\n<span data-contrast=\"auto\">Hence was the discourse of Islamic Literature, which revolved around its conceptualisation while simultaneously advocating its usage as a tool and catalyst for goodness within Muslim societies. From the writings of the intellectuals mentioned above, one will conclude that there is no dearth of materials and writings that can inspire current and future generations of writers who wish to produce good works of Islamic Literature. The aforementioned writers have presented their own different understanding and philosophies of Islamic Literature, and though they were formed based on the realities of their time, they are nevertheless of much value and should ideally be familiarised by future writers. In the context of this article, I would say that there is a need for any Singaporean Muslim writer who wishes to produce Islamic literary works to form their own unique understanding and philosophy so as to achieve clarity and purpose in their works. This can only be achieved by studying the writings of past intellectuals.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">With Muhammad Sa'd Ramadan's Muslim-centric definition, Kuntowijoyo's concept of Prophetic Literature, and Shahnon Ahmad's understanding of literature as a form of worship <\/span><i><span data-contrast=\"auto\">(ibadah), <\/span><\/i><span data-contrast=\"auto\">therein lies a few important elements that I believe should be factored in by present and future English Islamic Literature writers in the context of Singapore. First would be the primary audience and readers that they are addressing through their works. In other words, though the artistry and aesthetics can be inclusive of and sensitive towards various traditions, the essence of Islamic Literature should be a work primarily written for the local Muslim community, addressing its problems, advocating for relevant reforms, instilling hope and courage. Such an aim should not be deemed as exclusive, as it does not necessarily<\/span> <span data-contrast=\"auto\">mean that such literary works would only be relevant and understandable for Muslims. But rather, the objective of the work is to primarily resonate with the local Muslim community, with the purpose of advocating for morals and values rooted in Islamic tradition, which would be inherently universal. I believe this should be of priority, as works that are both localised and Islamic are in short supply as compared to the contrary.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">However, with the local Muslim community in mind, the understanding of its context, dynamics, and demographics, is crucial as well. This brings me to my second point, which is the need for writers to adopt a socio-historical approach to identify the trends and challenges facing the community so as to enlighten and resonate with the current generation of readers. In today's case, the understanding that Islamic Literature is synonymous with Malay Literature is misplaced, sidelining the experiences of minority Muslims, including converts. The diversity of the Muslim community should ideally be represented and acknowledged in Islamic Literature, taking into account the various ethnicities and identities within the community. In this regard, Islamic Literature writers should also embrace the unique plurality and cosmopolitanism that surrounds the Muslim community in Singapore, which should present an array of current relevant themes, depending on the focus of the writer.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Nevertheless, while I advocate a strong and firm grasp of Islamic Literature discourse, I must acknowledge from both observation as a literary advocate and personal experience as an author, that producing novels in current context encompasses several challenges. To elaborate substantially requires more space and a specific article of its own, though I will share some. The first point that I would raise, in the context of publishing English Islamic Literature works in Singapore, would be the challenge of finding suitable publishers that are able to give the necessary support in editing, printing, marketing, and publishing. This challenge is of course related to economic factors, where the financial incentives of publishing Islamic Literature works is considerably lower as compared to other genres of literature. In this regard, I do believe that the resources and capabilities exist within the Muslim community, though it remains to be seen how such a business model can be sustainable. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">On the other hand, we would also have to acknowledge the challenge that comes from producing creative Islamic literary works itself. Sustainability is also dependent on whether there will be a consistent supply of such works, which as we can observe in recent years, has been quite low in quantity. This, however, as aforementioned, does not necessarily translate into lack of demand. Nevertheless, here I would propose the need to mobilise and pump in resources to first develop a supply of English Islamic Literature. A case in hand that we can learn from is regarding the number of Malay novels written by Singapore writers over the decades. A simple online search will show us the following statistics: 1965 – 1970 (20 novels); 1971 – 1980 (29 novels); 1981 – 1990 (12 novels); 1991 – 2000 (18 novels); 2001 – 2010 (77 novels); 2011 – 2015 (14 novels). The jump in numbers between 1991-2000 and 2001-2010, from 18 to 77 novels can be explained with writing competitions organised by ASAS'50, which were then published by Pustaka Nasional. Here, we see that organisational support is crucial, especially in local context. It is possible that such efforts can be replicated.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">In his monumental work, <\/span><i><span data-contrast=\"auto\">Islamic Literature Discourse in Malaysia and Indonesia<\/span><\/i><span data-contrast=\"auto\">, Mohd Faizal Musa observed the different factors that allowed Islamic Literature to flourish in the two countries. The main one being that in Islamic Literature in Malaysia was very much supported by the state as compared to in Indonesia, where the grassroots institutions such as <\/span><i><span data-contrast=\"auto\">pesantrens <\/span><\/i><span data-contrast=\"auto\">played a significant role in advocating Islamic Literature. He outlined the benefits of both efforts<sup>[4]<\/sup>. In the context of Singapore, much can be learnt from the two cases in how we can uplift Islamic Literature discourse and improve its output. Acknowledging our local context, the basis of any initiative must come first from the ground, i.e. the <\/span><i><span data-contrast=\"auto\">asatizah<\/span><\/i><span data-contrast=\"auto\"> fraternity, literary advocates, etc, though I would say the task should primarily fall upon the religious fraternity. As mentioned in a previous article I wrote, titled <\/span><i><span data-contrast=\"auto\">Literature and Singapore's Islamic Fraternity<\/span><\/i><span data-contrast=\"auto\">,'<sup>[5]<\/sup><\/span> the mission to elevate the quality and quantity of the fraternity's output is possible due to the existing strong literary tradition that exists within. What is needed currently is to direct resources and discourse towards developing potential writers and nurturing current ones.<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<span data-contrast=\"auto\">Here, organisations and institutions – be it existing or potential new ones – must be willing to step forward in advocating Islamic Literature discourse and encourage creative writing. I cannot help but to think of the upcoming Singapore College of Islamic Studies (SCIS) as a possible institution that can spearhead such an effort. While these are still early days, I hope that the institution will focus on nurturing the Islamic Arts and developing a tradition of Islamic literature rooted in Singapore's context. For example, it is plausible for the institution to have a Writer-In-Residence to encourage and inspire the students and the fraternity. For this to happen, there must be widespread realisation and consciousness towards the importance and relevance of Islamic Literature, both in English and Malay. The Indonesian scholar and intellectual, Sahal Mahfudh, wrote that Islamic advocacy has a symbiotic relationship with arts and culture, in which through its utilisation, it may elevate a community's awareness towards the importance of religiosity in a way that does not cause social unrest, but rather strengthen social development<sup>[6]<\/sup>. It is my hope and wish that there will be writers in the upcoming generations who are committed to publishing works of Islamic Literature.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>\r\n\r\n<a href=\"#_ftnref1\" name=\"_ftn1\"><\/a>\r\n\r\n<sup>1<\/sup><small>Majid, M. Y. A., Toklubok, P., &amp; Musa, M. F. (2017). Gagasan sastera Islam (profetik) oleh Kuntowijoyo.<em> Jurnal Sultan Alauddin Sulaiman Shah, 4<\/em>(2). Retrieved from https:\/\/jsass.uis.edu.my\/index.php\/jsass\/article\/view\/117\/99<\/small>\r\n<sup>2<\/sup><small>Yaacob, A. B. (2017). Konsep Sastera Islam Oleh Shahnon Ahmad (Shahnon Ahmad's Concept of Islamic Literature). <em>Journal of Islamic, Social, Economics and Development, 2<\/em>(4), pp.66-93. https:\/\/academicinspired.com\/jised\/article\/view\/864\/864 <\/small>\r\n<sup>3<\/sup><small>Al-Buti, M. S. R. (2021). Sastera Islami: Retrospeksi dan Visi (Islamic Literature: Retrospection and Vision) (M. Syafiq Ismail, Trans.). Kuala Lumpur: pp. 27-28<\/small>\r\n<sup>4<\/sup><small>Musa, M. F. (2012). Sastera Islam Malaysia dan Indonesia (Islamic literature of Malaysia and Indonesia). Serdang: University Putra Malaysia<\/small>\r\n<sup>5<\/sup><small>Ubaidillah, A. (2024). Literature and Singapore’s Islamic Fraternity. Retrieved from https:\/\/ahmadubaidillah.com\/2024\/04\/15\/literature-and-singapores-islamic-fraternity\/<\/small>\r\n<sup>6<\/sup><small>Majelis Ulama Indonesia. (2021). Prinsip dan Panduan Umum Seni Islami (Principles and General Guide on Islamic Arts). Jakarta: BukuRepublika. pp.22<\/small>\r\n\r\n<hr \/>\r\n\r\n<i><span data-contrast=\"auto\">Ahmad Ubaidillah Mohd Khair is currently a Research Analyst at the Centre of Research on Islamic and Malay Affairs (RIMA). He holds an Islamic Jurisprudence degree from Yarmouk University, Jordan. His research interests are literature discourse and sociology of religion. He has also written for other platforms such Muslim.sg, Wasat Online, and Berita Mediacorp.<\/span><\/i><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559740&quot;:276}\"> <\/span>","post_title":"Thoughts on English Islamic Literature in Singapore's Context","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"thoughts-on-english-islamic-literature-in-singapores-context","to_ping":"","pinged":"","post_modified":"2025-01-27 13:06:32","post_modified_gmt":"2025-01-27 05:06:32","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4880","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"},
{"ID":"4878","post_author":"232","post_date":"2025-01-27 13:06:13","post_date_gmt":"2025-01-27 05:06:13","post_content":"<strong>Monument of Hope<\/strong>\r\n\r\nIn an era characterised by rapid technological advancements and continual evolution of competencies to navigate the complexities of the modern world, the mosque has served as an enduring sanctuary of faith and healing. This space has served all groups; both young and old, to seek refuge, reconnect and immerse in their intrinsic nature; the Fitrah, in seeking the path of spiritual renewal to Allah SWT, the Most Gracious and Most Merciful.\r\n\r\nThe existence of mosques dates back to the time of the Prophet Muhammad <em>(pbuh)<\/em> during his notable emigration to Madinah. Taking the stance to build a mosque in this new land, the strategic move would allow Muslims to pray, learn and socialise. This strengthened the nascent bond of the Muslim brotherhood between the Muhajirun and the Ansar, leading to a fundamentally strong, sound, confident and religious society. In the annals of Islamic history, successors established new mosques, suited to the waves of time, and the function of mosques expanded into a multitude of innovative structures.\r\n\r\nIn Singapore, mosques have long served as a monumental symbol of hope and identity for the Muslim community, tracing their significance back to the arrival of Islam on the island. These religious institutions are regarded as irreplaceable treasures, whose destruction would provoke widespread outrage among Muslims across all sects. As such, the mosque functions as a timeless emblem of Islamic identity in the region. The Muslim community in Singapore has faced a range of challenges in preserving and maintaining these mosques, including bureaucratic, administrative, manpower, and resource-related obstacles.\r\n\r\nThis article aims to clarify the critical importance of mosque-related work and seeks to explore potential areas for improvement, with the goal of fostering an ecosystem of mosque communities that thrive and contribute to the continued success of Muslims in Singapore.\r\n\r\n<strong>Historical Significance of Mosques in Singapore<\/strong>\r\n\r\nSingapore’s history with mosques is distinctive, shaped by the unique demographic composition of the nation. As a multicultural and multi-religious society, the establishment and preservation of mosques have been fraught with challenges and compromises, reflecting the broader tension between religious identity and the demands of a secular state. In the early stages of Islamic Religious Council of Singapore (MUIS), the responsibility of maintaining mosques became a critical concern, particularly as the forces of modernisation began to encroach upon the country. Singapore was no longer the rural, <em>kampung<\/em> (village) environment that it had once been.\r\n\r\nWith the advent of new leadership and governmental policies, a significant restructuring of religious spaces took place, particularly in the realm of urban redevelopment. The Singaporean government mandated the demolition of several religious institutions, including 11 mosques and 172 temples<a href=\"#_ftn1\" name=\"_ftnref1\"><sup>[1]<\/sup><\/a>, to make way for modern infrastructure. This policy decision ignited widespread dissent, underscoring the profound sensitivity of religious institutions to their communities. For Singapore’s Muslim population, this marked a pivotal moment in the evolution of their relationship with the mosque. What had traditionally been viewed as the modest, communal ‘<em>kampung<\/em> mosque’ gradually transformed into a more bureaucratically structured institution, one that not only required systematic management but also increasingly represented a crucial component of Muslim identity in the modern Singaporean context.\r\n\r\n<strong> <\/strong><strong>Creative Outreach, to Reach the Masses<\/strong>\r\n\r\nMosques in Singapore operate under a governance structure that significantly differs from those in Muslim-majority countries. In contrast to the more traditional and communal management systems prevalent in neighbouring countries, mosques here are characterised by a more centralised, regulated, and systematic approach. This operational model is largely influenced by the distinctive nature of the Singaporean state, which is marked by a strong emphasis on efficiency and performance metrics.\r\n\r\n“Here in Singapore, Muslims aim to create <em>masjids<\/em> with the scope and functions reminiscent of <em>masjids<\/em> that existed during the golden days of Islam. Financed entirely from voluntary contributions to the Mosque Building Fund, the <em>masjids<\/em> are run by volunteers who give freely of their time and energy. Such is the commitment and sense of ownership that Muslims have towards their <em>Masjids<\/em>.”<a href=\"#_ftn2\" name=\"_ftnref2\"><sup>[2]<\/sup><\/a> In the words of President of MUIS, Hj Maarof Salleh, mosques must continuously thrive in a manner that is compatible with the movement of time and context, especially in a country like Singapore. From the early stages of mosque restructuring, administrative and bureaucratic frameworks were introduced to formalise mosque operations, moving beyond the volunteer-driven model that had previously prevailed.\r\n\r\nThis new structure was crucial, not as an indicator that the governing body (MUIS) was scrutinising  mosques, rather, it was to ensure that mosques would consistently produce Islamic programmes to allure the society back to Islamic values. This marked the introduction of roles like Mosque Executive Chairman, District Superintendent, and other specialised positions into the mosque’s ecosystem<a href=\"#_ftn3\" name=\"_ftnref3\"><sup>[3]<\/sup><\/a>, designed to recalibrate the mosque’s focus and ensure the delivery of high-quality Islamic programmes.\r\n\r\nThough a topic of debate and complexity, there remains a prevalent sentiment, particularly among the youth, that Malay Muslim organisations, including mosques, often perceive or assume that mosque activities are outdated and misaligned with the type of Islam that resonates with their preferences or modern sensibilities. This belief usually stems from those who either are nescient to mosque activities or decide to not partake in them entirely. For this very reason, the dwindling numbers of youths today wanting to partake in mosques activities have become alarming, especially post COVID-19, where many became more acclimated with learning Islam online.\r\n\r\nThese circumstances underscore the critical importance of having creative and dedicated individuals – staff, board members, and volunteers – who are capable of engaging and attracting more people to the mosques. The objective is not to compete with international institutions or online platforms, but rather for local mosques to serve as tangible embodiments of Islam within the country. The mosque, as a physical sanctuary, holds a unique responsibility to remain a trusted source of Islamic guidance.\r\n\r\nPlanning bodies must actively seek solutions and strategies tailored to the evolving needs of society as it moves through various cultural and social trends. Mosque personnel should feel empowered to move beyond traditional initiatives that may no longer resonate, adopting more innovative approaches to <em>da'wah<\/em> (Islamic outreach) and engagement. This call for innovation is not an advocacy for the abandonment of traditional practices, but rather an affirmation that mosques can remain progressive and attuned to contemporary needs, rather than merely replicating programmes that may no longer be as effective.\r\n\r\nHowever, this shift is not without challenges. New approaches may provoke skepticism, particularly among those who fear that adapting to modern contexts might undermine core principles and values—a concern that is, in many respects, valid.\r\n\r\nTrailblazing in mosque programmes can be both harmless and, in fact, highly beneficial, provided it is well-managed and remains consistent with Islamic values and fundamental ethical principles. The community, in general, should be open to embracing new approaches to mosque programming, particularly in light of the declining engagement among youth, both in terms of mosque attendance and broader interest in religion. Such innovations are crucial to revitalising the relevance of mosques in contemporary society.\r\n\r\nMosque officers should be up to date with current issues and understand what the current community needs (to which will always be changing through time) rather than being stringent on certain modes and efforts that do not attract the youths nor the seniors. The programmes become dispensable and if done in large amounts, superfluous and ambiguous in their objectives and intended outcomes. This is where all mosques and planning committees should be clear, as to why and how every programme works, and not for mere execution to achieve and reach certain Key Performance Indicators (KPIs). Mosques must be ready to learn that some things can be changed to cater to the needs of the current community more grounded and rooted by the sound teachings of the Qur’an and Sunnah even if unexplored. This is where the art of listening and reading the community rather than blind execution becomes crucial to uplift the mosques’ methodology of <em>da’wah<\/em>.\r\n\r\n<strong>Empowering the Youths <\/strong>\r\n\r\nYouth play a central role in nation-building, holding the key to shaping the success or decline of the future. Mosques must leverage this potential by adapting and enhancing their activities to engage young people, particularly those who perceive the mosque as dull, unappealing, and primarily for older or more devout individuals. This presents a significant challenge: mosques must strive to create dynamic and inclusive spaces where Singaporean Muslim youth can envision and shape their ideal futures, initiate their own projects, and forge meaningful connections within the mosque community.\r\n\r\nMoreover, Muslim youth should be encouraged to take pride in their Islamic identity and contribute actively to the advancement of their faith. The mosque provides an ideal platform for cultivating an ecosystem of future leaders. In this context, innovative strategies to re-engage youth in mosque activities are crucial, especially in the post-COVID era. While youth groups were once a staple of mosque life, their influence has waned in the aftermath of the pandemic, underscoring the need for fresh, engaging approaches to revitalise youth participation.\r\n\r\nWhile this remains a continuous challenge, mosques such as Ar-Raudhah Mosque conduct their own sets of youth activities that are fresh and new, such as ‘Youth Sleepovers’ or ‘Bonding Al-Fateh Ar-Raudhah’ where youths come together to share and listen to advice from young <em>asatizah<\/em> themselves. This also includes being acquainted with litanies such as the <em>Ma’thurat<\/em>, for them to carry as a habit of their daily lives.<a href=\"#_ftn4\" name=\"_ftnref4\"><sup>[4]<\/sup><\/a> Apart from direct family members and parents, mosques should aim to create an impact on the spiritual lives of youths. For this reason, mosques in Singapore should take a proactive approach in gathering and analysing data on youth engagement and activism within the mosque, while also implementing comprehensive outreach initiatives to connect with young people who may not have had the privilege of growing up in a religious environment. This is the type of ecosystem we aim to cultivate—one where, amidst the increasing prevalence of secular values, religious values can continue to thrive and retain their significance.\r\n\r\nIn other non-conventional ways of pulling the crowds to the mosque, Al-Falah Mosque also launched an inaugural programme to attract young parents, called ‘Mosque Night with Mom &amp; Dad’. The programme served as a mean to dispel narratives that children cannot have fun in the mosques and to re-educate the community that children may use this space as they freely wish, as much as their parents. The event is fresh and unique, for it creates a space with bouncy castles, games and stations for kids to play, manned by the youths of the mosque, followed by a <em>Qiyamullail<\/em> <a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a> for parents and children the next morning. This comes to show that unconventional approaches of <em>da’wah<\/em> may spur more people to see the mosques as an inclusive space for all, and not merely a space of prayer.\r\n\r\nBencoolen Mosque also launched its youth study space for youths to utilise the comfortable and conducive space. Such spaces serve as an alternative from other study spaces like cafes and libraries, particularly for Muslim youths, since the mosque would allow for them to pray <em>jemaah<\/em> and perform their religious duties while revising.<a href=\"#_ftn6\" name=\"_ftnref6\"><sup>[6]<\/sup><\/a> This effort unconsciously spurs youths to think of prayer as a convenience, since the space itself is connected to the mosque. Like all other efforts, these initiatives come with a price of maintenance. The critique of such efforts often centres on the challenge of sustaining and promoting these spaces, ensuring that programmes and initiatives do not remain isolated successes or become redundant, thus undermining their original purpose and resulting in a waste of resources.\r\n\r\nIn this regard, these efforts, though unique and innovative, allow core values to remain intact while the delivery methods are adapted to meet the needs and contexts of individuals.\r\n\r\n<strong>Towards an Advanced and Intellectual Community through the Mosque<\/strong>\r\n\r\nIt is critical to recognise that mosques must be places of intellectual advancement, particularly in the Islamic sciences. This has long been the tradition of Islamic civilisation, as exemplified by historic mosques such as Masjid An-Nabawi, Qarawiyyin Mosque, and the Alhambra. In an era where social media is both a boon and a bane, mosque officers in Singapore should look to the future, utilising these platforms as an opportunity to develop supplementary online content. This should be supervised by trained <em>asatizah<\/em>, who are typically active within the mosque sector, allowing them to stay updated on new skills and technological trends in social media, ultimately to spread Islam through digital channels.\r\n\r\nTaking Yaqeen Institute in the United States as a prime example, along with other Islamic institutions, mosques in Singapore should follow suit by creating creative, impactful content. These initiatives would enhance public trust in Singapore's mosques and demonstrate to both local and international audiences that Singapore's mosques are capable of producing high-quality content comparable to those in the Middle East, the United States, and Southeast Asia.\r\n\r\nHowever, this process is not without challenges, particularly since producing content is an intellectually demanding task. Yet, the long-term benefits for the mosque's image and outreach are significant. One notable example is Assyakirin Mosque, which has successfully created engaging, bite-sized videos in the Malay language discussing Islamic values. These videos have garnered impressive views and high levels of engagement. This trend offers a window of opportunity for mosques to explore new, creative ways to enter the digital realm and build an online presence. Such efforts can also enhance the mosque’s credibility, foster greater interest in supporting mosque programmes, and encourage donations. Subconsciously, this form of <em>da'wah<\/em> adds value to the educational mission of the mosque, reaching a wider community through the accessibility of social media, even with simple, bite-sized content.\r\n\r\nThe people of Singapore’s mosques should embrace the digital realm and explore creative, limitless ways to attract patrons, social media users, and donors. By doing so, they can foster a deeper connection to the mosque, inspire contributions, and cultivate a sense of community.\r\n\r\n<strong>Conclusion: Maintaining the Purpose<\/strong>\r\n\r\nChange is usually easier said than done. Working and carrying the torch is not a simple task as usually deemed to be, especially towards progress and renewal. More importantly, it is a trust conferred by Allah SWT towards his selected servants, in which every act would be questioned on the day of judgement.\r\n\r\nThe mosque has a unique opportunity – and a responsibility – to go beyond its current efforts in reaching out to both Muslims and non-Muslims. It should actively engage in spreading the teachings of Islam while also showcasing the passion and commitment of Muslims in embodying religious values. These values, timeless and universal, remain relevant across all times and places.\r\n\r\nThe verse of Allah SWT stresses on the people of the mosque most succinctly yet deep and profound:\r\n<p style=\"padding-left: 30px;\"><em>The mosques of Allah should only be maintained by those who believe in Allah and the Last Day, establish prayer, pay alms-tax, and fear none but Allah. It is right to hope that they will be among the truly guided.<a href=\"#_ftn7\" name=\"_ftnref7\"><sup><strong>[7]<\/strong><\/sup><\/a><\/em><\/p>\r\nIf this verse would be emulated in its entirety in the context of our mosques here in Singapore, while curating programmes or content, we would reach the zenith of success, and the amelioration of the Muslim community. The goal is that these actions, though modest, will generate a lasting ripple effect that benefits future generations.\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-size: small;\"><em> <\/em><a href=\"#_ftnref1\" name=\"_ftn1\"><sup>[1]<\/sup><\/a> Saat, N. (2018). Fulfilling the Trust: 50 years of shaping Muslim religious life in Singapore. <em>World Scientific<\/em>, p. 133<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref2\" name=\"_ftn2\"><sup>[2]<\/sup><\/a> Sapawi, T. (2000). Mosques Guide 2000<em>. Majlis Ugama Islam Singapura<\/em> (MUIS), p. 3<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref3\" name=\"_ftn3\"><sup>[3]<\/sup><\/a> Saat, N. (2018). Fulfilling the Trust: 50 years of shaping Muslim religious life in Singapore. <em>World Scientific<\/em>, p. 141<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref4\" name=\"_ftn4\"><sup>[4]<\/sup><\/a> Cue. (2024, October 24). Membangun potensi belia  melalui pelbagai program masjid. <em>Berita Harian<\/em>. <a href=\"https:\/\/www.beritaharian.sg\/singapura\/membangun-potensi-belia-pelbagai-program-masjid\">https:\/\/www.beritaharian.sg\/singapura\/membangun-potensi-belia-pelbagai-program-masjid<\/a><\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> <em>Qiyamullail <\/em>is the supererogratory night prayer, performed one third of the night<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref6\" name=\"_ftn6\"><sup>[6]<\/sup><\/a> Yusoff, S. (2024, March 1). Masjid Bencoolen dibuka semula: Hab Belia baharu galak belia pupuk jalinan bermakna dengan masjid.<em>BERITA Mediacorp<\/em>. <a href=\"https:\/\/berita.mediacorp.sg\/singapura\/masjid-bencoolen-dibuka-semula-hab-belia-baharu-galak-belia-pupuk-jalinan-bermakna-dengan-masjid-828736\">https:\/\/berita.mediacorp.sg\/singapura\/masjid-bencoolen-dibuka-semula-hab-belia-baharu-galak-belia-pupuk-jalinan-bermakna-dengan-masjid-828736<\/a><\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref7\" name=\"_ftn7\"><sup>[7]<\/sup><\/a> Surah At-Taubah, Verse 18<\/span>\r\n\r\n<hr \/>\r\n\r\n<em>Sharifah Inshirah Aljunied is a graduate from The University of Jordan, with a Bachelor’s Degree in Arabic Language and Literature. Sharifah is currently serving Al-Falah Mosque as an Executive Marcom, and teaches teens and youths at various mosques on a part-time basis.<\/em>","post_title":"Mosques, A Catalyst for Change in the Muslim Community","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"mosques-a-catalyst-for-change-in-the-muslim-community","to_ping":"","pinged":"","post_modified":"2025-01-27 13:14:16","post_modified_gmt":"2025-01-27 05:14:16","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4878","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"1"},
{"ID":"4876","post_author":"226","post_date":"2025-01-27 13:08:41","post_date_gmt":"2025-01-27 05:08:41","post_content":"&nbsp;\r\n\r\nRamadhan, the ninth month of the Islamic calendar, is widely recognised as a period dedicated to fasting, prayer, and spiritual reflection among Muslims worldwide. From dawn until sunset, we abstain from food, drink, and other physical needs, purifying the soul, fostering self-discipline, and deepening our respective connections with Allah. This month is also traditionally associated with self-reflection, heightened devotion, and acts of charity, which align closely with core Islamic values.\r\n\r\nIn recent years though, observers have noted a shift in how Ramadhan is practiced with greater commercialisation, particularly over-consumption and opulence. While this article merely focuses on food consumption, it merely scratches the surface as this extends well into excess spending and flagrant displays of materialism. One may argue that these may diminish the spiritual essence of the month, emphasising indulgence over introspection and piety, particularly regarding the consumption of food during sahur (the pre-dawn meal) and iftar (the meal to break the fast at sunset). These meals, initially intended as simple sustenance to support the fast and encourage gratitude, are becoming more elaborate. This trend toward indulgence and culinary excess has drawn attention for its potential to diverge from principles of moderation and self-restraint that are integral to fasting, as well as its impact on the opportunities for spiritual growth and empathy toward those in need.\r\n\r\nThese changes stand in stark contrast to the realities faced by many Muslims worldwide who are unable to observe Ramadhan in comfort due to war, displacement, and severe economic hardships. In countries like Syria, Yemen, Palestine, and Afghanistan, ongoing conflicts leave countless families struggling with hunger and insecurity. Refugees and internally displaced persons often lack access to even basic necessities, let alone the ability to celebrate Ramadhan in the traditional sense.\r\n\r\nFor these communities, fasting takes on an entirely different meaning – an extension of their daily struggle for survival. The evening meal to break the fast, which is a moment of celebration and gratitude for many, might consist of the barest scraps, if anything at all. This stark disparity between those who endure Ramadhan in hardship and those who observe it amidst abundance prompts a deeper question about how Muslims worldwide can embody the spirit of the month: through empathy, solidarity, and action to alleviate suffering.\r\n\r\n<strong>Commercialisation to Materialism<\/strong>\r\n\r\nIftar, arguably, traditionally a family-centred tradition, has increasingly evolved into a platform for economic and social posturing. Lavish iftar dinners hosted by larger organisations have become tools for public relations and, according to some critics, a way to showcase wealth. This trend reflects the rising visibility of religion in public spaces and the emergence of an affluent Muslim bourgeoisie, which is not necessarily a bad thing. However, there appears little resistance to such gatherings being politicised and highly focused on their lavishness and social exclusivity, increasingly turning them into more a social activity than a religious one.\r\n\r\nA good example<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a> from Türkiye is the Ciragan Sarayi, a lavish 19th-century Ottoman palace now operating as a luxury hotel, usually used for hosting high-profile weddings. During Ramadhan, it becomes a hub for corporate iftar gatherings and as expressed by Ulku Karadaglilar, an executive at the Ciragan that “a company to have iftar here is a kind of statement…It is like asking, 'Where did you have your wedding or gala event?' With only one chance each year, they want the very best.\" This shift is also felt by high-ranking individuals like Cemal Usak, secretary-general of Istanbul’s Intercultural Dialogue Platform, who admits to “have an iftar to attend almost every night...I’ve only had a chance to break fast with my family twice this Ramadhan.\"\r\n\r\nOzlem Sandikci, a marketing professor at Ankara’s Bilkent University specialising in consumerism, noted that \"Across the Muslim world, Ramadhan – a time for fasting, prayer, and reflection – is increasingly resembling a cultural and commercial holiday.\" Nilufer Narli, a sociologist at Istanbul's Bahcesehir University also noted that \"the religiously conservative and newly urbanised middle classes and upper middle classes have given increased importance to the iftar dinner and have influenced the established middle classes.\" The trend is not limited to Türkiye. In Dubai, luxury hotels set up elaborate iftar tents with vast buffet spreads, catering to those seeking an opulent way to break their fast. In Cairo, exclusive restaurants and clubs attract diners eager to see and be seen, spending on a single meal what the average Egyptian earns in two weeks.\r\n\r\nAs expected with any commercialised holiday, an opportunity is created for businesses to sell the “Ramadhan vibes” to maximise customer spending and engagement through for example, competing TV shows, advertisements, decorations, new clothing and furniture – basically new everything. On top of that, racing to reserve a place in a popular restaurant for the food, exclusive dishes carefully designed for the occasion and social media posts of having been there. This is not a trend centred in the Middle East and Türkiye. In the Southeast Asian regions, specifically Singapore, Malaysia and Indonesia, renowned restaurants and especially hotels have jumped on this bandwagon for years offering lavish buffets, offering immersive experiences breaking one’s fast in a luxurious setting. While these events provide opportunities for communal gatherings, they also raise questions about maintaining the spiritual essence of Ramadhan amidst increasing commercialisation and indulgence.\r\n\r\nThis list is non-exhaustive, and it would be interesting to have a study conducted in our community on evolving Ramadhan traditions and activities but here is what I feel is the real problem: this is a religious occasion, materialism and indulgence are redefining it and not everyone will be able to afford this evolving new Ramadhan.\r\n\r\n<strong>Over-eating<\/strong>\r\n\r\nDespite Ramadhan being a time for fasting and spiritual reflection, overeating has ironically, become a common issue once the sun sets. Jumping back to the Middle East, many hospitals across the Gulf states see a significant rise in inpatient cases during Ramadhan.\r\n\r\nDoctors in this region generally see a surge in patient visits with gastronomic issues during Ramadhan. Dr Rabee Harb, a family doctor at Kuwait’s Royale Hayat Hospital, noted he sees a noticeable increase in digestive-related complaints, particularly indigestion, gastroenteritis, and peptic ulcer disease. The impact of fasting on health has become a growing concern in Gulf countries and in 2011, the Hamad Medical Corporation in Doha reported over 7,700 cases in the first week of Ramadhan alone. Dana Al Shakaa, a dietitian at the American Hospital in Dubai, claims to “treat an extra five to six patients a day during this time” and even points out a troubling trend: a rise in diabetes diagnoses during Ramadhan, with many patients neglecting their medications due to disrupted eating and sleeping patterns<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a>.\r\n\r\nIn the United Arab Emirates, emergency departments also report an increase in food-related health issues during Ramadhan, particularly due to overeating. Indigestion is the most common complaint, as people tend to consume substantial amounts of food in a short period. Dr Archana Baju, a clinical dietitian at Burjeel Hospital, explains that after long hours of fasting, the metabolism slows down, and it is crucial to introduce food slowly when breaking the fast<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a>.\r\n\r\n<strong>Food waste<\/strong>\r\n\r\nThere is little data available on the state of food wastage in our Southeast Asian region during the month of Ramadhan, though the Middle East has, in recent years started looking into addressing food wastage. Looking at the data below, it may not surprise us that we probably reflect similar trends due to evolving trends in how Ramadhan is being practiced in our own community. In general,<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a>\r\n<ul>\r\n \t<li><strong>Saudi Arabia:<\/strong> Approximately 30–50% of food prepared during Ramadhan is discarded. Annually, the country wastes around 4 million tons of food.<\/li>\r\n \t<li><strong>United Arab Emirates:<\/strong> Food waste surges by up to 67% during Ramadhan.<\/li>\r\n \t<li><strong>Qatar:<\/strong> About 25% of food prepared during Ramadhan ends up as waste.<\/li>\r\n \t<li><strong>Bahrain:<\/strong> Food waste increases by 50% during the holy month.<\/li>\r\n \t<li><strong>Riyadh:<\/strong> Approximately 30 percent of 4 million dishes prepared daily in Ramadhan is wasted.” Translated into money, it amounts to SR1.2 million<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a> (about SGD 433,638.13) every day.<\/li>\r\n \t<li><strong>General Trend:<\/strong> It is estimated that 15–25% of all food purchased or prepared during Ramadhan is discarded across various Muslim-majority countries.<\/li>\r\n<\/ul>\r\nSo, this Ramadhan, what can you do to be more mindful of your food purchases and consumption?\r\n<ol>\r\n \t<li><strong>Talk about food waste.<\/strong> Speak to your peers on your thoughts regarding food waste following Islamic principles of sustainability.<\/li>\r\n \t<li><strong>Serve fewer options.<\/strong> Focus on quality and not quantity. You have a full month to achieve variety and enjoy all the dishes you love with your family. Moderation is key.<\/li>\r\n \t<li><strong>Think about your portions.<\/strong> Take what you need and eat what you take. Start with smaller portions and serve yourself again with more small portions. Remember that most of us feel full easily after a full day of fasting.<\/li>\r\n \t<li><strong>Plan your meals.<\/strong> Again, you have a full month to achieve variety in your meals. Plan your food preparation and be prepared to freeze or even donate unprepared or excess food to reduce wastage.<\/li>\r\n<\/ol>\r\n<strong>Practicing Greater Mindfulness in Ramadhan<\/strong>\r\n\r\nRamadhan is a month of abrupt changes, from disrupted mealtimes and sleep schedules to balancing our busy lives on an empty stomach. I personally find this month the greatest test of self-discipline. At the heart of our consumer society though, where we are spoiled with options and convenience of easy access to goods and services for our various needs and wants, I feel this month requires us to take a step back and return to the centre and meaning of our lives. Through deep introspection, it reminds us of the importance of detail, precision and discipline in our religious practices; specific days and timing of our fasts, the specific days and timing within the month itself for additional acts of worship and charity; the meaning of this holy month goes beyond going hungry and preparing for the first day of Shawal and its celebrations.\r\n\r\nBeyond the practices, let us also not neglect practicing our faith with our hearts through acts of forgiveness, charity and understanding, particularly those around us who cannot afford to keep up with material purchases for Aidilfitri celebrations and acknowledge the struggles of fellow Muslims enduring conflict and hunger in conflicted countries worldwide. This upcoming Ramadhan, let us observe it more mindfully, to transform Ramadhan of 2025 from a time of personal indulgence into a meaningful expression of faith and compassion.\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Schleifer, Y., (2008). Ramadan trend: Iftar emerges as high-profile social event. <em>The Christian Science Monitor. <\/em>Retrieved from https:\/\/www.csmonitor.com\/World\/Middle-East\/2008\/0923\/p01s04-wome.html<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Carrington, D., (2013). Not so fast: Ramadan sees rise in binge eating and A&amp;E cases. CNN. Retrieved from https:\/\/edition.cnn.com\/2013\/08\/07\/world\/meast\/ramadan-over-eating-eid\/index<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Bell, J. (2021). UAE doctors warn of overeating at Iftar to avoid a trip to the hospital. <em>Alarabiya News. <\/em>Retrieved from https:\/\/english.alarabiya.net\/News\/gulf\/2021\/04\/15\/UAE-doctors-warn-of-overeating-at-Iftar-to-avoid-a-trip-to-the-hospital-#:~:text=Doctors%20in%20the%20United%20Arab,gastroenteric%20issues%20and%20stomach%20ulcers.<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Altantawy, S. (2024). Overeating on the rise in Ramadan: rpt. <em>LinkedIn News. <\/em>Retrieved from https:\/\/www.linkedin.com\/news\/story\/overeating-on-the-rise-in-Ramadhan-rpt-5958924\/<\/span>\r\n\r\n<span style=\"font-size: small;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Taga, A. H. (2016). A third of Ramadan food is wasted. <em>Arab News. <\/em>Retrieved from  https:\/\/www.arabnews.com\/node\/941786\/saudi-arabia<\/span>\r\n\r\n<hr \/>\r\n\r\n<em>Rifhan Miller is Centre Manager for the Centre for Research on Islamic and Malay Affairs (RIMA). Her research interests include gender equality, and social justice issues.<\/em>","post_title":"The Commercialisation of Ramadhan: What Happened to the Ramadhan Spirit?","post_excerpt":"","post_status":"publish","comment_status":"open","ping_status":"open","post_password":"","post_name":"the-commercialisation-of-ramadhan-what-happened-to-the-ramadhan-spirit","to_ping":"","pinged":"","post_modified":"2025-01-27 13:08:41","post_modified_gmt":"2025-01-27 05:08:41","post_content_filtered":"","post_parent":"0","guid":"https:\/\/saifsmiles.link\/karyawan\/?p=4876","menu_order":"0","post_type":"post","post_mime_type":"","comment_count":"0"}
]
}
]
